Repository: elandev22/elandome
Catalog: locale/*/LC_MESSAGES/django.po
Languages: es, fi, fr

source: Wangari is a mediator practising with The Judiciary of Kenya, an arbitrator and a member of the Chartered Institute of Arbitrator UK and Kenya. She strives to be a well-rounded advocate who can effectively handle diverse areas in the law, to develop a successful legal career founded on a good reputation, to be an exceptionally sensitive and dedicated advocate and to ensure that justice is served to each member of the society.
es: Wangari es una mediadora que ejerce en el Poder Judicial de Kenya, árbitro y miembro del Chartered Institute of Arbitrator Reino Unido y Kenia. ella se esfuerza por ser un defensor completo que puede manejar con eficacia diversas áreas del derecho, para desarrollar un sistema jurídico exitoso carrera fundada en una buena reputación, para ser un defensor excepcionalmente sensible y dedicado y a asegurar que se haga justicia a cada miembro de la sociedad.
fi: Wangari on sovittelija, joka harjoittelee The Judicy of:n kanssa Kenia, välimies ja Charteredin jäsen Institute of Arbitrator UK ja Kenia. Hän pyrkii olemaan monipuolinen asianajaja, joka pystyy käsittelemään tehokkaasti eri aloilla lain, kehittää onnistunut oikeudellinen ura perustuu hyvään maineeseen, olla poikkeuksellisen herkkä ja omistautunut puolestapuhuja varmistaa, että oikeus toteutuu jokaiselle yhteiskunnan jäsenelle.
fr: Wangari est un médiateur exerçant auprès de la magistrature de Kenya, arbitre et membre du Chartered Institute of Arbitrator Royaume-Uni et Kenya. Elle s'efforce d'être un avocat bien équilibré qui peut gérer efficacement divers domaines du droit, pour développer un système juridique efficace carrière fondée sur une bonne réputation, être un avocat exceptionnellement sensible et dévoué et à

source: Want to know more?
es: ¿Quieres saber más?
fi: Haluatko tietää lisää?
fr: Vouloir en savoir davantage?

source: Visit our
es: Visita nuestro
fi: Vieraile meillä
fr: Visitez notre

source: Get in touch with us. Our team is happy to help you to answer any questions you may have.
es: Póngase en contacto con nosotros. Nuestro equipo está feliz de ayudarlo a responder cualquier pregunta usted puede tener.
fi: Ota yhteyttä meihin. Tiimimme auttaa mielellään vastaamaan kaikkiin kysymyksiin sinulla voi olla.
fr: Prenez contact avec nous. Notre équipe est heureuse de vous aider à répondre à toutes vos questions vous pouvez avoir.

source: Talk to Us
es: Háblanos
fi: Puhu meille
fr: Parle-nous

source: Get in touch with us. Our team is happy to help you to
es: Póngase en contacto con nosotros. Nuestro equipo está encantado de ayudarle a
fi: Ota yhteyttä meihin. Tiimimme auttaa sinua mielellään
fr: Prenez contact avec nous. Notre équipe est heureuse de vous aider à

source: answer any questions you may have.
es: responder cualquier pregunta que pueda tener.
fi: vastaa kaikkiin kysymyksiisi.
fr: répondre à toutes les questions que vous pourriez avoir.

source: Subscribe to our Newsletter
es: Suscríbete a nuestro Boletín
fi: Tilaa uutiskirjeemme
fr: Abonnez-vous à notre newsletter

source: Subscribe to get more updates from us.
es: Suscríbete para recibir más actualizaciones de nosotros.
fi: Tilaa saadaksesi lisää päivityksiä meiltä.
fr: Abonnez-vous pour recevoir plus de mises à jour de notre part.

source: Subscribe
es: Suscribir
fi: Tilaa
fr: S'abonner

source: Fill the form below
es: Rellene el siguiente formulario
fi: Täytä alla oleva lomake
fr: Remplissez le formulaire ci-dessous

source: Your names should match as they are in your passport.
es: Sus nombres deben coincidir con los que aparecen en su pasaporte.
fi: Nimesi tulee vastata passissasi olevia nimiä.
fr: Vos noms doivent correspondre tels qu'ils figurent sur votre passeport.

source: First Name
es: Primer Nombre
fi: Etunimi
fr: Prénom

source: Last Name
es: Apellido
fi: Sukunimi
fr: Nom de famille

source: Preferred Name
es: Nombre Preferido
fi: Haluttu nimi
fr: nom préféré

source: Email
es: Correo electrónico
fi: Sähköposti

source: Street Address
es: Dirección
fi: Katuosoite
fr: Adresse de rue

source: City
es: Ciudad
fi: Kaupunki
fr: Ville

source: State
es: Estado
fi: Osavaltio
fr: État

source: Province
es: Provincia
fi: maakunta

source: Country of Origin
es: País de origen
fi: Alkuperämaa
fr: Pays d'origine

source: Home Phone
es: Teléfono de casa
fi: Kotipuhelin
fr: Téléphone fixe

source: Mobile Phone
es: Teléfono móvil
fi: Kännykkä
fr: Téléphone mobile

source: Office Tel.
es: Teléfono de la oficina
fi: Toimisto Puh.
fr: Bureau Tél.

source: Gender
es: Género
fi: Sukupuoli
fr: Le genre

source: Date of Birth
es: Fecha de nacimiento
fi: Syntymäaika
fr: Date de naissance

source: Nationality
es: Nacionalidad
fi: Kansallisuus
fr: Nationalité

source: Preferred Program
es: Programa Preferido
fi: Suosittu ohjelma
fr: Programme préféré

source: Emergency Contact
es: Contacto de emergencia
fi: Yhteystiedot hätätilanteissa
fr: Personne à contacter en cas d'urgence

source: Full Name
es: Nombre completo
fi: Koko nimi
fr: Nom et prénom

source: Telephone No.
es: Teléfono no.
fi: Puhelinnumero.
fr: N ° de téléphone.

source: Residential Address
es: Dirección residencial
fi: Asunnon osoite
fr: Adresse résidentielle

source: Relationship
es: Relación
fi: Suhde
fr: Relation

source: Referee Contact
es: Árbitro Contacto
fi: Erotuomarin yhteystiedot
fr: Coordonnées de l'arbitre

source: Organization
es: Organización
fi: Organisaatio
fr: Organisme

source: Work Address
es: Dirección de trabajo
fi: Työosoite
fr: Adresse professionnelle

source: Your Education
es: Tu educación
fi: Koulutuksesi
fr: Votre éducation

source: Experience
es: Experiencia
fi: Kokea
fr: Vivre

source: Health conditions, disabilities e.t.c.
es: Condiciones de salud, discapacidades, etc.
fi: Terveysongelmat, vammat jne.
fr: Conditions de santé, handicaps, etc.

source: Personalized Preferrences
es: Preferencias personalizadas
fi: Henkilökohtaiset asetukset
fr: Préférences personnalisées

source: Travel Pax
es: Pasajero de viaje
fr: Voyageur

source: Preferred Package
es: Paquete Preferido
fi: Ensisijainen paketti
fr: Forfait préféré

source: Duration of stay
es: Duración de la estancia
fi: Oleskelun kesto
fr: La durée du séjour

source: Preferred City
es: Ciudad Preferida
fi: Suosittu kaupunki
fr: Ville préférée

source: When would you like to travel?
es: Cuando te gustaria viajar?
fi: Milloin haluaisit matkustaa?
fr: Quand aimerais-tu voyager?

source: Do you require further information?
es: ¿Necesita más información?
fi: Tarvitsetko lisätietoja?
fr: Avez-vous besoin de plus d'informations?

source: How did you hear about us?
es: ¿Cómo te enteraste de nosotros?
fi: Kuinka kuulit meistä?
fr: Comment avez-vous entendu parler de nous?

source: Any other comments
es: algún otro comentario
fi: Muita kommentteja
fr: D'autres commentaires

source: Submit
es: Enviar
fi: Lähetä
fr: Soumettre

source: Contact Us
es: Contacta con Nosotros
fi: Ota meihin yhteyttä
fr: Nous contacter

source: FULL NAME
es: NOMBRE COMPLETO
fi: KOKO NIMI
fr: NOM ET PRÉNOM

source: EMAIL
es: Correo electrónico

source: SUBJECT
es: TEMA
fi: AIHE
fr: SUJET

source: MESSAGE
es: MENSAJE
fi: VIESTI

source: How much time do I need to volunteer?
es: ¿Cuánto tiempo necesito para ser voluntario?
fi: Kuinka paljon aikaa tarvitsen vapaaehtoistyöhön?
fr: De combien de temps ai-je besoin pour faire du bénévolat?

source: ELAN Dome Consultants prides itself in creating volunteer schedules based on the desires of our clients. We offer volunteer opportunities for both short term and long term periods and this is left to the discretion of the volunteer. For instance, you can volunteer for a week, two weeks, a month and even a year.
es: ELAN Dome Consultants se enorgullece de crear horarios de voluntariado basados en los deseos de nuestros clientes Ofrecemos oportunidades de voluntariado tanto para periodos de corto como de largo plazo y esto queda a criterio del voluntario. Por ejemplo, puede ofrecerse como voluntario para una week, two weeks, a month and even a year.
fi: ELAN Dome Consultants on ylpeä luomisestaan vapaaehtoistyön aikataulut toiveiden mukaan asiakkaistamme. Tarjoamme vapaaehtoistyömahdollisuuksia sekä lyhyellä että pitkällä aikavälillä ja tämä jätetään valtuuston päätettäväksi vapaaehtoisena. Voit esimerkiksi tehdä vapaaehtoistyötä a viikko, kaksi viikkoa, kuukausi ja jopa vuosi.
fr: ELAN Dome Consultants est fier de créer horaires des bénévoles en fonction des envies de nos clients. Nous offrons des opportunités de bénévolat pour des périodes à court et à long terme et cela est laissé à la discrétion du bénévole. Par exemple, vous pouvez vous porter volontaire pour un semaine, deux semaines, un mois et même un an.

source: Will I get training before I volunteer?
es: ¿Recibiré capacitación antes de ser voluntario?
fi: Saanko koulutusta ennen vapaaehtoistyötä?
fr: Vais-je suivre une formation avant de faire du bénévolat?

source: You will go through a very insightful orientation process for all the organizations and institutions that you volunteer in which will give you a better understanding of how they operate and how best to apply yourself.
es: Pasarás por un muy perspicaz proceso de orientación para todas las organizaciones y instituciones en las que eres voluntario y en las que darle una mejor comprensión de cómo operar y cuál es la mejor manera de aplicarlo usted mismo.
fi: Tulet käymään läpi erittäin oivaltavaa perehdytysprosessi kaikille organisaatioille ja laitoksia, joissa teet vapaaehtoistyötä antaa sinulle paremman käsityksen siitä, miten ne toimia ja miten parhaiten soveltaa itseäsi.
fr: Vous passerez par une très perspicace processus d'orientation pour toutes les organisations et institutions dans lesquelles vous faites du bénévolat et qui vous permettre de mieux comprendre comment ils fonctionner et la meilleure façon de vous appliquer.

source: How old do I have to be to volunteer?
es: ¿Qué edad debo tener para ser voluntario?
fi: Kuinka vanha minun pitää olla voidakseni tehdä vapaaehtoistyötä?
fr: Quel âge dois-je avoir pour faire du bénévolat?

source: We have no age limits for volunteering. Volunteers below the age of 18 will have to be accompanied by a parent or a guardian and have properly documented consent to participate in our various volunteer programs.
es: No tenemos límites de edad para el voluntariado. Los voluntarios menores de 18 años deberán ser Acompañado por un padre o tutor y tener consentimiento debidamente documentado para participar en nuestros diversos programas de voluntariado.
fi: Meillä ei ole ikärajaa vapaaehtoistyölle. Alle 18-vuotiaiden vapaaehtoisten tulee olla vanhemman tai huoltajan seurassa asianmukaisesti dokumentoitu suostumus osallistua erilaisissa vapaaehtoisohjelmissamme.
fr: Nous n'avons pas de limite d'âge pour faire du bénévolat. Les bénévoles de moins de 18 ans devront être accompagné d'un parent ou d'un tuteur et avoir consentement dûment documenté à participer dans nos divers programmes de bénévolat.

source: Do I need qualifications?
es: ¿Necesito calificaciones?
fi: Tarvitsenko pätevyyttä?
fr: Ai-je besoin de qualifications ?

source: Some of our volunteering opportunities require qualifications. Our healthcare volunteer programs are fully based on our volunteers healthcare background and training for proper records of the same will have to be submitted to ensure effective placement. If particular qualifications are needed this will be stated in our pre engagement sessions.
es: Algunas de nuestras oportunidades de voluntariado requieren calificaciones Nuestro voluntario de salud los programas se basan totalmente en nuestros voluntarios antecedentes de atención médica y capacitación para los registros de la misma deberán ser presentados a garantizar una colocación efectiva. si particular se necesitan calificaciones esto se indicará en nuestras sesiones previas al compromiso.
fi: Jotkut vapaaehtoistyömahdollisuuksistamme vaativat pätevyys. Terveydenhuollon vapaaehtoisemme ohjelmat perustuvat täysin vapaaehtoisihimme terveydenhuoltotausta ja asianmukainen koulutus tietueet samasta on toimitettava ensure effective placement. If particular vaaditaan pätevyys, tämä mainitaan our pre engagement sessions.
fr: Certaines de nos opportunités de volontariat nécessitent qualifications. Notre bénévole de la santé les programmes reposent entièrement sur nos bénévoles expérience en soins de santé et formation pour une bonne les enregistrements de la même chose devront être soumis à assurer un placement efficace. Si particulier des qualifications sont nécessaires, cela sera indiqué dans nos séances pré fiançailles.

source: Can I get a qualification or an award?
es: ¿Puedo obtener una calificación o un premio?
fr: Puis-je obtenir une qualification ou un prix?

source: Our volunteers get several benefits from their volunteering journey ranging from a resume that stands out, transforming communities, exploring and cultivating interest areas, a safe and convenient way to travel abroad with adequate assistance and finally getting the opportunity to take on a new adventure. ELAN Dome also offers a valuable certificate of completion to all volunteers along with access to a wide network of volunteers, program coordinators, local organizations, and support staff.
es: Nuestros voluntarios obtienen varios beneficios de su viaje de voluntariado que va desde un currículum que sobresale, transformando comunidades, explorar y cultivar áreas de interés, una forma segura y conveniente de viajar al extranjero con la asistencia adecuada y finalmente tener la oportunidad de asumir un nueva aventura. ELAN Dome también ofrece una valiosa certificado de finalización a todos los voluntarios junto con el acceso a una amplia red de voluntarios, coordinadores de programas, organizaciones locales, y personal de apoyo.
fi: Our volunteers get several benefits from their volunteering journey ranging from a resume joka erottuu, muuttaa yhteisöjä, kiinnostuksen kohteiden tutkiminen ja viljeleminen, turvallinen ja kätevä tapa matkustaa ulkomaille riittävän avun kanssa ja vihdoinkin tilaisuus ottaa vastaan a uusi seikkailu. ELAN Dome tarjoaa myös arvokasta todistus suorituksesta kaikille vapaaehtoisille sekä pääsy laajaan verkkoon vapaaehtoiset, ohjelmakoordinaattorit, paikalliset järjestöt, and support staff.
fr: Nos bénévoles tirent plusieurs avantages de leur parcours de volontariat allant d'un CV qui se démarque, transformant les communautés, explorer et cultiver des domaines d'intérêt, un moyen sûr et pratique de voyager à l'étranger avec une assistance adéquate et avoir enfin l'opportunité d'assumer un nouvelle aventure. ELAN Dome offre également un précieux certificat d'achèvement à tous les bénévoles ainsi que l'accès à un vaste réseau de bénévoles, coordonnateurs de programmes, organismes locaux,

source: What else can I do during my volunteering journey?
es: ¿Qué más puedo hacer durante mi viaje de voluntariado?
fi: Mitä muuta voin tehdä vapaaehtoistyöni aikana?
fr: Que puis-je faire d'autre pendant mon parcours de volontariat ?

source: Aside from volunteering and helping underserved communities, we create avenues where our volunteers can make more memories through leisure activities.Some of these activities include:
es: Además de ser voluntario y ayudar a los desatendidos comunidades, creamos avenidas donde nuestros los voluntarios pueden hacer más recuerdos a través de actividades de ocio. Algunas de estas actividades incluyen:
fi: Paitsi vapaaehtoistyö ja alipalvettujen auttaminen yhteisöille, luomme väyliä, joissa meidän vapaaehtoiset voivat tehdä enemmän muistoja kautta vapaa-ajan toimintaa. Joitakin näistä toiminnoista ovat:
fr: En plus de faire du bénévolat et d'aider les personnes mal desservies communautés, nous créons des avenues où nos les bénévoles peuvent créer plus de souvenirs grâce à activités de loisirs.Certaines de ces activités comprennent:

source: Taking Weekend Trips (beach visits, hiking, camping)
es: Hacer viajes de fin de semana (visitas a la playa, caminatas, campamentos)
fi: Viikonloppumatkat (rantavierailut, vaellus, telttailu)
fr: Faire des voyages le week-end (visites à la plage, randonnées, camping)

source: Sampling local cuisine
es: Degustación de la cocina local.
fi: Maistamassa paikallista ruokaa
fr: Goûter à la cuisine locale

source: Safari drives in local game parks and reserves
es: Safaris en parques y reservas locales
fi: Safari ajaa paikallisissa pelipuistoissa ja suojelualueilla
fr: Safari conduit dans les parcs et réserves de gibier locaux

source: How long do the workshops and trainings take?
es: ¿Cuánto duran los talleres y capacitaciones?
fi: Kuinka kauan työpajat ja koulutukset kestävät?
fr: Combien de temps durent les ateliers et les formations ?

source: This is left to the discretion of the client. ELAN Dome is very passionate about tailor making the workshop and training program. We structure them after carefully understanding the needs of our clients so as to ensure that positive outcomes are realized.
es: Esto se deja a la discreción del cliente. A ELAN Dome le apasiona la sastrería elaboración del taller y programa de capacitación. Nosotros estructurarlos después de entender cuidadosamente las necesidades de nuestros clientes para garantizar que se obtienen resultados positivos.
fi: Tämä jätetään valtuuston päätettäväksi asiakas. ELAN Dome on erittäin intohimoinen räätälöintiin työpajan ja koulutusohjelman tekeminen. Me jäsentää ne huolellisesti ymmärtämisen jälkeen asiakkaidemme tarpeet varmistaaksemme että positiiviset tulokset toteutuvat.
fr: Ceci est laissé à la discrétion du client. ELAN Dome est très passionné par le tailleur réalisation de l'atelier et du programme de formation. Nous les structurer après avoir bien compris les besoins de nos clients afin d'assurer que des résultats positifs sont obtenus.

source: How can I keep tabs on my investment?
es: ¿Cómo puedo controlar mi inversión?
fi: Kuinka voin pitää sijoitukseni silmällä?
fr: Comment puis-je garder un œil sur mon investissement ?

source: ELAN Dome strives to enhance accountability and clarity for all our investment supervision activities. We make our clients part of the journey even when they are away in different countries so that at every particular juncture they are fully aware of what actions are being taken with regards to their investment.
es: ELAN Dome se esfuerza por mejorar la rendición de cuentas y claridad para toda nuestra supervisión de inversiones actividades. Hacemos que nuestros clientes sean parte del viaje incluso cuando están lejos en diferentes países para que en cada particular coyuntura son plenamente conscientes de qué acciones se están tomado con respecto a su inversión.
fi: ELAN Dome pyrkii lisäämään vastuullisuutta ja selkeyttä kaikelle sijoitusvalvonnallemme toimintaa. Teemme asiakkaamme osaksi matka vaikka he ovat poissa eri maissa niin että jokaisessa juncture they are fully aware of what actions are being investointejaan.
fr: ELAN Dome s'efforce d'améliorer la responsabilité et de la clarté pour tous nos suivis d'investissement activités. Nous faisons de nos clients une partie de voyage même lorsqu'ils sont absents dans différents pays afin qu'à chaque moment où ils sont pleinement conscients des actions en cours prises au regard de leur investissement.

source: What project management approach do you use?
es: ¿Qué enfoque de gestión de proyectos utiliza?
fi: Mitä projektinhallintatapaa käytät?
fr: Quelle approche de gestion de projet utilisez-vous?

source: ELAN Dome's project management approaches are fully pegged and influenced by the kind of project we are tasked with at any given time. Please reach out to us about a specific project and we will be able to give a detailed overview of the approach
es: Enfoques de gestión de proyectos de ELAN Dome están totalmente vinculados e influenciados por el tipo de proyecto que estamos encargado en un momento dado. por favor alcance a nosotros sobre un proyecto específico y podremos dar una descripción detallada del enfoque
fi: ELAN Domen projektijohtamisen lähestymistavat ovat täysin sidoksissa siihen, millainen projekti olemme tehtävänä milloin tahansa. Ota yhteyttä kerro meille tietystä projektista, niin voimme antaa yksityiskohtaisen yleiskatsauksen lähestymistavasta
fr: Les approches de gestion de projet d'ELAN Dome sont entièrement ancrés et influencés par le type de projet que nous sommes chargé à un moment donné. Veuillez joindre nous parler d'un projet spécifique et nous serons en mesure de donner un aperçu détaillé de l'approche

source: None of these FAQs answers my question, what do I do now?
es: Ninguna de estas preguntas frecuentes responde a mi pregunta, ¿qué hago ahora?
fi: Mikään näistä usein kysytyistä kysymyksistä ei vastaa kysymykseeni, mitä teen nyt?
fr: Aucune de ces FAQ ne répond à ma question, que dois-je faire maintenant?

source: If we haven't covered your question please get in touch with us through our email
es: Si no hemos cubierto su pregunta, póngase en contacto con nosotros a través de nuestro email
fi: Jos emme ole käsittäneet kysymystäsi, ota meihin yhteyttä kauttamme email
fr: Si nous n'avons pas répondu à votre question, veuillez nous contacter via notree-mail

source: detailing your questions
es: detallando sus preguntas
fi: yksityiskohtaisesti kysymyksesi
fr: détailler vos questions

source: and we'll be happy to help.
es: y estaremos encantados de ayudar.
fi: ja autamme mielellämme.
fr: et nous serons heureux de vous aider.

source: 12th Floor
es: Piso 12
fi: 12. kerros

source: Phone
es: Teléfono
fi: Puhelin
fr: Téléphoner

source: Website
es: Sitio web
fi: Verkkosivusto
fr: Site Internet

source: Pay Us a Visit
es: Haznos una visita
fi: Tule käymään
fr: Rendez-nous visite

source: All Rights Reserved.
es: Reservados todos los derechos.
fi: Kaikki oikeudet pidätetään.
fr: Tous les droits sont réservés.

source: EDC Community
es: EDC Comunidad
fi: EDC-yhteisö
fr: Communauté EDC

source: Families
es: Familia
fi: Perheet
fr: Familles

source: Our family packages create an avenue for bonding with your loved ones, immersing your family in a different culture and giving back to communities.
es: Nuestros paquetes familiares crean una vía para vincularse con su Amados, sumergiéndose su familia en una cultura diferente y retribuir a comunidades.
fi: Perhepakettimme luovat yhteyden luomiseen rakkaat, upottamalla perheesi eri kulttuurissa ja antaa takaisin communities.
fr: Nos forfaits familiaux créent une avenue pour créer des liens avec votre proches, immersion votre famille dans une culture différente et redonner à communautés.

source: Friends
es: Amigos
fi: Ystävät
fr: Amis

source: Our friends package takes buddies through an experience that strengthens friendships and transforms social lives for the better.
es: Nuestro paquete de amigos lleva a los amigos a través de una experiencia que fortalece amistades y transforma la vida social para mejor.
fi: Ystäväpakettimme vie kaverit läpi kokemuksen, joka vahvistaa ystävyyssuhteita ja muuttaa sosiaalista elämää parempaan suuntaan.
fr: Notre forfait amis emmène les copains à travers une expérience qui renforce amitiés et transforme la vie sociale pour le mieux.

source: Students
es: Estudiantes
fi: Opiskelijat
fr: Étudiantes
