Repository: elandev22/elandome
Catalog: locale/*/LC_MESSAGES/django.po
Languages: es, fi, fr

source: Get to know about us and our journey.
es: Conozca sobre nosotros y nuestro viaje.
fi: Tutustu meihin ja matkaamme.
fr: Apprenez à nous connaître et à connaître notre parcours.

source: Get acquainted with our team and understand how we work and proceed towards success.
es: Conozca a nuestro equipo y comprenda cómo trabajamos y avanzamos hacia el éxito.
fi: Tutustu tiimiimme ja ymmärrä, miten toimimme ja etenemme kohti menestys.
fr: Familiarisez-vous avec notre équipe et comprenez comment nous travaillons et procédons vers Succès.

source: About ELAN Dome Consultants
es: Acerca de ELAN Dome Consultants
fi: Tietoja ELAN Dome Consultantsista
fr: À propos de ELAN Dôme Consultants

source: ELAN (Education, Learning and Networking) Dome Consultants is an Africa based, bred and youth-led social & corporate outsourcing consultancy firm that strives to reshape the path of social service and international business engagements for students, individuals and institutions interested in integrating international experience and community service by offering high-quality international volunteer and service-learning engagements.
es: ELAN (Educación, Aprendizaje y Redes) Dome Consultants es una basado en África, criado y empresa de consultoría de subcontratación social y corporativa dirigida por jóvenes que se esfuerza por reconfigurar el camino de lo social servicios y compromisos comerciales internacionales para estudiantes, personas e instituciones interesadas en la integración de la experiencia internacional y el servicio comunitario por ofreciendo alta calidad internacional compromisos de voluntariado y aprendizaje-servicio.
fi: ELAN (Education, Learning and Networking) Dome Consultants on Afrikassa, kasvatettu ja nuorisojohtoinen sosiaalinen ja yritysulkoistuskonsulttiyritys joka pyrkii muotoilemaan uudelleen sosiaalisen polun palvelu- ja kansainvälinen yritystoiminta opiskelijoille, kiinnostuneet henkilöt ja laitokset kansainvälisen kokemuksen ja yhteisön palvelun yhdistämisessä tarjoaa korkealaatuista kansainvälistä vapaaehtoistyötä ja palveluoppimista.
fr: ELAN (Education, Learning and Networking) Dome Consultants est un Basé en Afrique, élevé et société de conseil en externalisation sociale et d'entreprise dirigée par des jeunes qui s'efforce de remodeler le chemin de la société des engagements de service et d'affaires internationales pour les étudiants, personnes et institutions intéressées à intégrer l'expérience internationale et le service communautaire en offrant des services internationaux de haute qualité engagements de bénévolat et d'apprentissage par le service.

source: Additionally, ELAN Dome Consultants offers supervision and implementation support services, organizational programming, project management, external quality assurance checks, curriculum research and development and international students collaboration projects. Our aim is to enhance impactful initiatives in Africa by promoting cultural exchange, reliable investment in projects and holistic learning for local citizens in the diaspora and the international community.
es: Además, ELAN Dome Consultants ofrece supervisión y servicios de apoyo a la implementación, programación organizacional, gestión de proyectos, calidad externa controles de seguridad, investigación curricular y proyectos de desarrollo y colaboración de estudiantes internacionales. Nuestro objetivo es potenciar iniciativas impactantes en África mediante la promoción del intercambio cultural, la inversión fiable en proyectos y aprendizaje holístico para locales ciudadanos de la diáspora y la comunidad internacional.
fi: Lisäksi ELAN Dome Consultants tarjoaa valvontaa ja käyttöönoton tukipalvelut, organisaation ohjelmointi, projektinhallinta, ulkoinen laatu varmuustarkastukset, opetussuunnitelmatutkimukset ja kehitys- ja kansainvälisten opiskelijoiden yhteistyöprojekteja. Tavoitteenamme on edistää vaikuttavia aloitteita Afrikassa edistämällä kulttuurivaihtoa, luotettavia investointeja hankkeita ja kokonaisvaltaista oppimista paikallisille diasporan ja kansainvälisen yhteisön kansalaisia.
fr: De plus, ELAN Dome Consultants offre une supervision et services d'aide à la mise en œuvre, programmation organisationnelle, gestion de projet, qualité externe vérifications d'assurance, recherche de programmes et projets de développement et de collaboration d'étudiants internationaux. Notre objectif est de valoriser les initiatives impactantes en Afrique en promouvant les échanges culturels, des investissements fiables dans projets et apprentissage holistique pour les citoyens de la diaspora et de la communauté internationale.

source: Our Mission
es: Nuestra misión
fi: Tehtävämme
fr: Notre mission

source: To match prospective individuals and institutions with communities and organizations through global networking and partnerships.
es: Poner en contacto a personas e instituciones potenciales con comunidades y organizaciones a través de redes y asociaciones globales.
fi: Kohdistaa mahdolliset yksilöt ja laitokset yhteisöihin ja organisaatioiden maailmanlaajuisen verkostoitumisen ja kumppanuuksien kautta.
fr: Mettre en relation des personnes et des institutions potentielles avec des communautés et organisations par le biais de réseaux et de partenariats mondiaux.

source: Our Vision
es: Nuestra Visión
fi: Näkemyksemme
fr: Notre vision

source: Experiential learning beyond borders
es: Aprendizaje experiencial más allá de las fronteras
fi: Kokemuksellinen oppiminen yli rajojen
fr: Apprentissage expérientiel au-delà des frontières

source: Client Focus Goal
es: Objetivo de Enfoque del Cliente
fi: Asiakaskeskeinen tavoite
fr: Objectif axé sur le client

source: Optimized logistical support, cultural experiences and fulfillment to the stakeholders.
es: Apoyo logístico optimizado, experiencias culturales y cumplimiento a los stakeholders.
fi: Optimoitu logistinen tuki, kulttuurielämyksiä ja täyttymystä sidosryhmiä.
fr: Soutien logistique optimisé, expériences culturelles et épanouissement au parties prenantes.

source: Primary Goal
es: Objetivo principal
fi: Päätavoite
fr: Objectif principal

source: To facilitate a seamless and targeted positioning of individuals, families, groups and institutions in local but impactful initiatives in Africa.
es: Facilitar un posicionamiento fluido y específico de individuos, familias, grupos e instituciones en iniciativas locales pero impactantes en África.
fi: Helpottaa saumatonta ja kohdennettua yksilöiden, perheiden, ryhmiä ja instituutioita paikallisissa mutta vaikuttavissa aloitteissa Afrikassa.
fr: Pour faciliter un positionnement homogène et ciblé des individus, familles, groupes et institutions dans des initiatives locales mais percutantes en Afrique.

source: Why Choose ELAN Dome Consultants
es: ¿Por Qué Elegir el ELAN Dome Consultants?
fi: Miksi valita ELAN Dome Consultants
fr: Pourquoi choisir les consultants ELAN Dome

source: Our efficient and experienced team members ensure that the journey of each participant turns out to be an incredible adventure.
es: Los eficientes y experimentados miembros de nuestro equipo aseguran que el viaje de cada el participante resulta ser una aventura increíble.
fi: Tehokkaat ja kokeneet tiimimme jäsenet varmistavat jokaisen matkan osallistujasta tulee uskomaton seikkailu.
fr: Les membres de notre équipe, efficaces et expérimentés, s'assurent que le parcours de chacun participant s'avère être une aventure incroyable.

source: We offer a variety of programs tailored for diverse groups. The aim is to make a positive impact on the society and the participating individuals by instilling relevant skills and values.
es: Ofrecemos una variedad de programas adaptados a diversos grupos. El objetivo es tener un impacto positivo en la sociedad y en los participantes individuos al inculcarles habilidades y valores.
fi: Tarjoamme monipuolista ohjelmaa eri ryhmille. Tavoitteena on vaikuttaa myönteisesti yhteiskuntaan ja osallistujaan yksilöiden juurruttamalla asiaankuuluvia taitoja ja arvoja.
fr: Nous offrons une variété de programmes adaptés à divers groupes. Le but est de avoir un impact positif sur la société et les participants individus en leur inculquant compétences et valeurs.

source: We have rolled out a localized integrated and dynamic international volunteer program for those seeking to experience Africa through service.
es: Hemos puesto en marcha un sistema internacional localizado, integrado y dinámico programa de voluntariado para aquellos que buscan experimentar África a través del servicio.
fi: Olemme ottaneet käyttöön paikallisen integroidun ja dynaamisen kansainvälisen vapaaehtoisohjelma niille, jotka haluavat kokea Afrikkaa palvelun kautta.
fr: Nous avons déployé un réseau international localisé, intégré et dynamique programme de volontariat pour ceux qui cherchent à découvrir l'Afrique à travers le service.

source: We look out for the best interests of our clients with our unmatched supervision and implementation support.
es: Velamos por los mejores intereses de nuestros clientes con nuestro inigualable supervisión y apoyo a la ejecución.
fi: Pidämme asiakkaidemme etua vertaansa vailla valvonta- ja täytäntöönpanotuki.
fr: Nous recherchons les meilleurs intérêts de nos clients avec notre inégalée supervision et appui à la mise en œuvre.

source: We offer a variety of programs tailored for diverse groups. The aim is to make a positive impact on the society and the participating individuals by instilling relevant skills and values.
es: Ofrecemos una variedad de programas adaptados para grupos diversos. El objetivo es generar un impacto positivo en la sociedad y el participante individuos al inculcarles habilidades y valores.
fi: Tarjoamme erilaisia räätälöityjä ohjelmia erilaisille ryhmille. Tavoitteena on vaikuttaa positiivisesti yhteiskuntaan ja osallistuva yksilöiden juurruttamalla asiaankuuluvia taitoja ja arvoja.
fr: Nous offrons une variété de programmes adaptés pour divers groupes. L'objectif est d'avoir un impact positif sur la société et le participant individus en leur inculquant compétences et valeurs.

source: Our Team of Experts
es: Nuestra Equipo de Expertas
fi: Asiantuntijatiimimme
fr: Notre équipe d'experts

source: Managing Director and Principal Consultant Partnerships and Corporate Affairs
es: Director General y Consultor Principal de Asociaciones y Asuntos Corporativos
fi: Toimitusjohtaja ja pääkonsultti Kumppanuudet ja yritysasiat
fr: Directeur général et consultant principal Partenariats et affaires corporatives

source: Awino is a seasoned Operations Lead with over five (5) years' experience in fast-paced multi-sectoral organisations across multiple countries. She has excelled in providing strategic, quality assurance, administrative, logistical, coordination and implementation support to high-level executives and project teams with multiple tasks. She facilitates human centred design thinking and challenge driven education workshops for faculty, corporate staff and university students.
es: Awino es un líder de operaciones experimentado con más de cinco (5) años de experiencia en el ritmo rápido organizaciones multisectoriales en múltiples países. Se ha destacado por brindar servicios estratégicos, aseguramiento de la calidad, administrativo, logístico, coordinación y apoyo a la ejecución de alto nivel ejecutivos y equipos de proyecto con múltiples tareas. Ella facilita el pensamiento de diseño centrado en el ser humano y talleres de educación impulsados por desafíos para profesores, personal corporativo y estudiantes universitarios.
fi: Awino on kokenut operaatiojohtaja, jolla on yli viisi (5) vuoden kokemus nopeatempoisesta monialaisia organisaatioita useissa maissa. Hän on loistanut strategisten, laadunvarmistus, hallinto, logistiikka, koordinointi- ja täytäntöönpanotuki korkealle tasolle johtajat ja projektiryhmät, joilla on useita tehtäviä. Hän helpottaa ihmiskeskeistä suunnitteluajattelua ja haastelähtöiset koulutustyöpajat tiedekunnalle, yritysten henkilökuntaa ja yliopisto-opiskelijoita.
fr: Awino est un responsable des opérations chevronné avec plus de cinq (5) ans d'expérience dans le rythme rapide organisations multisectorielles dans plusieurs pays. Elle a excellé dans la prestation de services stratégiques, assurance qualité, administratif, logistique, soutien à la coordination et à la mise en œuvre cadres et équipes de projet aux tâches multiples. Elle facilite la pensée de conception centrée sur l'humain et des ateliers d'éducation axés sur les défis pour les professeurs, personnel d'entreprise et étudiants universitaires.

source: She has also negotiated for partnerships, developed proposals and instituted partner stewardship programs and has also been involved in data collection, classification, clean-up, knowledge management and governance for various organizations. Some of the organizations she has worked in include: the Judiciary, Strathmore University, Coalition of Blood for Africa, Pamoja CBO and ABE UK as an external quality assurer.
es: También ha negociado asociaciones, desarrollado propuestas y programas de administración de socios instituidos y también ha estado involucrado en la recopilación de datos, clasificación, limpieza, gestión del conocimiento y gobernanza para diversas organizaciones. Algunas de las organizaciones que ella ha trabajado en incluyen: el Poder Judicial, Strathmore Universidad, Coalición de Sangre por África, Pamoja CBO y ABE UK como asegurador de calidad externo.
fi: Hän on myös neuvotellut kumppanuuksia, kehittänyt ehdotuksia ja perustettuja kumppanuusohjelmia ja on myös ollut mukana tiedonkeruussa, luokittelu, puhdistus, tiedonhallinta ja hallinto eri järjestöille. Jotkut järjestöt hän on työskennellyt muun muassa oikeuslaitoksessa, Strathmoressa Yliopisto, Coalition of Blood for Africa, Pamoja CBO ja ABE UK ulkopuolisena laadunvarmistajana.
fr: Elle a également négocié des partenariats, développé propositions et institué des programmes d'intendance des partenaires et a également participé à la collecte de données, classification, nettoyage, gestion des connaissances et gouvernance pour divers organismes. Certaines des organisations qu'elle a travaillé dans : la magistrature, Strathmore Université, Coalition of Blood for Africa, Pamoja CBO et ABE UK en tant qu'assureur qualité externe.

source: Director & Lead Consultant: Business Development, PR, Marketing & Communications
es: Director y consultor principal: desarrollo comercial, relaciones públicas, marketing y Comunicaciones
fi: Johtaja ja pääkonsultti: liiketoiminnan kehitys, PR, markkinointi ja Viestintä
fr: Directeur et consultant principal: développement des affaires, relations publiques, marketing et Communication

source: Akinyi is a design savvy and goal oriented professional with over three (3) years experience working in the BPO industry in different capacities within communications departments. She is driven and motivated to enhance business growth and develop beneficial networks. She is highly creative and has an eye for aesthetics and visual presentation.
es: Akinyi es un profesional experto en diseño y orientado a objetivos con mas de tres (3) años de experiencia trabajando en BPO industria en diferentes capacidades dentro de las comunicaciones departamentos Ella está impulsada y motivada para mejorar los negocios crecer y desarrollar redes beneficiosas. Ella es altamente creativo y tiene buen ojo para la estética y la presentación visual.
fi: Akinyi on suunnittelutaito ja tavoitteellinen ammattilainen yli kolmen (3) vuoden työkokemus BPO:ssa teollisuuden eri valmiuksia viestinnässä osastot. Hän on innostunut ja motivoitunut kehittämään liiketoimintaa kasvua ja hyödyllisten verkostojen kehittämistä. Hän on korkealla luova ja hänellä on silmää estetiikkaan ja visuaaliseen esitykseen.
fr: Akinyi est un professionnel avisé en matière de conception et axé sur les objectifs avec plus de trois (3) ans d'expérience de travail dans le BPO l'industrie à différents titres au sein des communications départements. Elle est motivée et motivée pour améliorer les affaires croissance et développer des réseaux bénéfiques. Elle est hautement créatif et a le sens de l'esthétique et de la présentation visuelle.

source: She is passionate about streamlining processes through proper planning and execution and utilises her diverse design background and strong organisational skills to increase efficiency, profitability and make an impact in all her engagements. Akinyi graduated with a Bachelor's Degree in Design from the University of Nairobi and is also an honorary member of the Public Relations Society of Kenya whose mandate is to advance excellence in Public Relations and Communication Management in Kenya.
es: Le apasiona agilizar los procesos a través de planificación y ejecución adecuadas y utiliza su diseño diverso antecedentes y sólidas habilidades organizativas para aumentar eficiencia, rentabilidad y causar impacto en todos sus compromisos. Akinyi se graduó con una Licenciatura en Diseño de la Universidad de Nairobi y también es miembro honorario de la Public Relaciones Sociales de Kenia, cuyo mandato es promover excellence in Public Relations and Communication Management in Kenya.
fi: Hän on intohimoinen prosessien virtaviivaistamiseen asianmukaista suunnittelua ja toteutusta sekä hyödyntää monipuolista suunnitteluaan tausta ja vahvat organisointitaidot kasvaa tehokkuutta, kannattavuutta ja vaikuttaa kaikissa hänen toimeksiannoissaan. Akinyi valmistui Muotoilun kandidaatiksi Nairobin yliopisto ja on myös yleisön kunniajäsen Relations Society of Kenia, jonka tehtävänä on edistyä huippuosaamista suhdetoiminnan ja viestinnän hallinnassa Keniassa.
fr: Elle est passionnée par la rationalisation des processus grâce à une planification et une exécution appropriées et utilise sa conception diversifiée expérience et de solides compétences organisationnelles pour augmenter efficacité, rentabilité et avoir un impact dans tous ses engagements. Akinyi est titulaire d'un baccalauréat en design de la Université de Nairobi et est également membre honoraire du Public Relations Society of Kenya dont le mandat est de faire progresser excellence en relations publiques et gestion de la communication au Kenya.

source: Director & Lead Consultant: Operational Management, Finance and Administration
es: Director y Consultor Principal: Gestión Operativa, Finanzas y Administración
fi: Johtaja ja pääkonsultti: Operatiivinen johto, talous ja Hallinto
fr: Directeur & Consultant principal : Gestion opérationnelle, Finance et Administration

source: Judith is a finance and administration expert who is passionate about social impact. She has over 5 years experience in working with adolescent Girls and young women including youths and 3 years experience in leadership and management of community health programs.
es: Judith es una experta en finanzas y administración que está apasionado por el impacto social. tiene mas de 5 años experiencia en el trabajo con niñas adolescentes y jóvenes mujeres incluyendo jóvenes y 3 años de experiencia en. Liderazgo y gestión de programas comunitarios de salud.
fi: Judith on talous- ja hallintoasiantuntija, joka on intohimoinen sosiaalinen vaikutus. Hänellä on yli 5 vuotta kokemusta työskentelystä nuorten tyttöjen ja nuorten parissa naiset mukaan lukien nuoret ja 3 vuoden kokemus yhteisön terveysohjelmien johtaminen ja hallinnointi.
fr: Judith est une experte en finances et en administration qui passionné par l'impact social. Elle a plus de 5 ans expérience de travail avec des adolescentes et des jeunes femmes y compris les jeunes et 3 ans d'expérience dans direction et gestion des programmes de santé communautaire.

source: She has experience leading donor funded projects and is accountable for making decisions, managing resources efficiently, achieving and sustaining high performing teams while maintaining high ethical standards. She is very passionate about self development and personal growth. She loves working and mentoring the youths to learn thrive and lead in different capacities. She believes in mentorship and coaching to help the youth attain self actualization.
es: Tiene experiencia liderando proyectos financiados por donantes y es responsable de la toma de decisiones, la gestión eficiente de los recursos, el logro Y sostenido alto equipos de alto desempeño manteniendo un alto nivel ético estándares Ella es muy apasionada por el desarrollo personal y personal. crecimiento. Le encanta trabajar y Tutoría a los jóvenes para aprender a prosperar y liderar en diferentes capacidades. Ella cree en la tutoría y el entrenamiento para ayudar a los los jóvenes alcanzan la autorrealización.
fi: Hänellä on kokemusta lahjoittajien rahoittamien hankkeiden johtamisesta ja hän on vastuussa päätösten tekemisestä, resurssien tehokkaasta hallinnasta, saavuttamisesta ja pysyy korkealla suorituskykyisiä tiimejä säilyttäen samalla korkea eettisyys standardit. Hän on erittäin intohimoinen itsensä kehittämiseen ja henkilökohtaiseen kehitykseen kasvu. Hän rakastaa työskentelyä ja ohjata nuoria oppimaan menestymään ja johtamaan toimintaan erilaisia kapasiteettia. Hän uskoo mentorointiin ja valmennukseen auttavan nuoret saavuttavat itsensä toteuttamisen.
fr: Elle a de l'expérience dans la direction de projets financés par des donateurs et est responsable de la prise de décisions, de la gestion efficace des ressources, de la réalisation et maintien élevé des équipes performantes tout en gardant un haut niveau éthique normes. Elle est très passionnée par le développement personnel et personnel croissance. Elle aime travailler et encadrer les jeunes pour qu'ils apprennent à s'épanouir et à diriger capacités différentes. Elle croit au mentorat et au coaching pour aider les les jeunes s'épanouissent.

source: External Experts
es: Expertos externos
fi: Ulkopuoliset asiantuntijat
fr: Experts externes

source: Legal Advisory Consultant
es: Consultor Asesor Jurídico
fi: Oikeudellinen neuvonantaja
fr: Conseiller Juridique

source: Wangari is a confident and meticulous advocate of the High Court of Kenya with professional experience in busy organisations such as the Kenya National Police Sacco and Equity Bank Kenya. She has also worked in reputable law firms like Mwandwa Macharia & Mwangi Co Advocates and Macharia Wa Muturi Co Advocates.
es: Wangari es una confiada y meticulosa defensora de la Tribunal Superior de Kenia con profesional experiencia en organizaciones ocupadas como Kenia Policía Nacional Sacco y Equity Bank Kenya. También ha trabajado en firmas de abogados de renombre como Mwandwa. Macharia & Mwangi Co Advocates y Macharia Wa Muturi Co defensores.
fi: Wangari on itsevarma ja huolellinen puolestapuhuja Kenian korkein oikeus ammattilaisten kanssa kokemusta kiireisistä organisaatioista, kuten Keniassa National Police Sacco ja Equity Bank Kenia. Hän on myös työskennellyt hyvämaineisissa asianajotoimistoissa, kuten Mwandwa Macaria & Mwangi Co Advocates ja Macaria Wa Muturi Co Advocates.
fr: Wangari est un défenseur confiant et méticuleux de la Haute Cour du Kenya avec des professionnels expérience dans des organisations actives telles que le Kenya Police nationale Sacco et Equity Bank Kenya. Elle a également travaillé dans des cabinets d'avocats réputés comme Mwandwa Macharia & Mwangi Co Advocates et Macharia Les avocats de Wa Muturi Co.
