Repository: elandev22/elandome
Catalog: locale/*/LC_MESSAGES/django.po
Languages: es, fi, fr

source: Additionally, we advise organisations on key strategic issues by leveraging on our industry knowledge and analytical prowess to enable them make informed decisions. This service enables them to achieve their business objectives by capitalising on opportunities and being prepared to mitigate potential risks.
es: Además, asesoramos a las organizaciones sobre estrategias clave aprovechando nuestro conocimiento de la industria y proeza analítica para permitirles tomar decisiones informadas decisiones Este servicio les permite lograr sus objetivos de negocio aprovechando las oportunidades y Estar preparado para mitigar riesgos potenciales.
fi: Lisäksi neuvomme organisaatioita keskeisissä strategisissa asioissa ongelmia hyödyntämällä alan tietämystämme ja analyyttinen kyky jotta he voivat olla tietoisia päätökset. Tämän palvelun avulla he voivat saavuttaa tavoitteensa liiketoimintatavoitteet hyödyntämällä mahdollisuuksia ja olla valmis vähentämään mahdollisia riskejä.

source: SMEs, FMCG, Consulting firms, INGOs, not for profit organizations including CBOs, CSOs, FBOs, civil societies, government, academic institutions and individuals.
es: PYME, FMCG, empresas de consultoría, ONGI, organizaciones sin fines de lucro, incluidas CBO, CSO, FBO, sociedades civiles, gobierno, instituciones académicas y individuos.
fi: Pk-yritykset, FMCG, konsulttiyritykset, järjestöt, voittoa tavoittelemattomat organisaatiot mukaan lukien CBO:t, kansalaisjärjestöt, elintarvikealan toimijat, kansalaisyhteiskunnat, hallitus, akateemiset laitokset ja yksilöitä
fr: PME, FMCG, cabinets de conseil, ONGI, organisations à but non lucratif, y compris Organisations communautaires, OSC, organisations confessionnelles, sociétés civiles, gouvernement, institutions universitaires et personnes.

source: Project Management
es: Gestión de proyectos
fi: Projektinhallinta
fr: Gestion de projet

source: We are the first choice custodians of your projects and resources on the ground. We source for quality and competitive resource plans, quotations, unique development plans and bespoke designs that are fairly priced and work with reputable experts to execute your vision and deliver beyond the expected outcomes.
es: Somos los custodios de primera elección de sus proyectos y recursos en el terrestre. Buscamos planes de recursos de calidad y competitivos, cotizaciones, desarrollo único planes y diseños a la medida que tienen un precio justo y trabajar con expertos de renombre para ejecutar su visión y entregar más allá de la allá de lo resultados esperados.
fi: Olemme projektiesi ja resurssien ensisijainen ylläpitäjä maahan. Hankimme laadukkaat ja kilpailukykyiset resurssisuunnitelmat, tarjoukset, ainutlaatuinen kehitys suunnitelmat ja mittatilaustyöt, jotka ovat kohtuuhintaisia ja työskentele hyvämaineisten asiantuntijoiden kanssa toteuttaaksesi visiosi ja toimittaaksesi sen pidemmälle odotetut lopputulokset.

source: Our areas of focus include: research, digitization, real estate & construction, corporate events (workshops and employee development programs), budgeting exercises and project fundraising initiatives.
es: Nuestras áreas de enfoque incluyen: investigación, digitalización, bienes raíces y construcción, eventos corporativos (talleres y desarrollo de empleados programas), ejercicios de presupuestación e iniciativas de recaudación de fondos para proyectos
fi: Painopistealueitamme ovat: tutkimus, digitalisointi, kiinteistöt ja rakentaminen, yritystapahtumat (työpajat ja henkilöstön kehittäminen ohjelmat), budjetointiharjoitukset ja hankkeiden varainkeruualoitteet.
fr: Nos domaines d'intervention comprennent: la recherche, la numérisation, l'immobilier et construction, événements corporatifs (ateliers et développement des employés programmes), des exercices de budgétisation et des initiatives de financement de projets.

source: Workshops & Training
es: Talleres y Capacitación
fi: Työpajat ja koulutus
fr: Ateliers & Formation

source: We design, recruit, facilitate, assess, tailormake and report on extra ordinary workshops, team building and training initiatives for teams and organizations. Our primary focus is on:
es: Diseñamos, contratamos, facilitamos, evaluamos, personalizamos e informamos informar sobre talleres extraordinarios, team building e iniciativas de formación por equipos y organizaciones. Nuestro enfoque principal está en:
fi: Suunnittelemme, rekrytoimme, helpotamme, arvioimme, räätälöimme ja raportoi tavallisista työpajoista, tiimin rakentamisesta ja koulutusaloitteista varten ryhmiä ja organisaatioita. Pääpainomme on:
fr: Nous concevons, recrutons, facilitons, évaluons, personnalisons et rapport sur les ateliers extraordinaires, les initiatives de consolidation d'équipe et de formation pour équipes et organisations. Notre objectif principal est de:

source: Management i.e crisis management, change management, conflict management and overall team management.
es: Gestión, es decir, gestión de crisis, gestión del cambio, gestión de conflictos y gestión general del equipo.
fi: Johtaminen eli kriisinhallinta, muutoksenhallinta, konfliktien hallinta ja joukkueen yleinen hallinta.
fr: Gestion, c'est-à-dire gestion de crise, gestion du changement, gestion des conflits et gestion globale de l'équipe.

source: Leadership i.e adaptable leadership, progressive organization culture, next level leadership, performance (financial & operational) and decision making analysis & design)
es: Liderazgo, es decir, liderazgo adaptable, cultura organizacional progresiva, siguiente nivel de liderazgo, rendimiento (financiero y operativo) y análisis de toma de decisiones y diseño)
fi: Johtajuus eli mukautuva johtaminen, edistyksellinen organisaatiokulttuuri, seuraavaksi tason johtajuus, suorituskyky (taloudellinen ja toiminnallinen) ja päätöksentekoanalyysi & design)
fr: Leadership, c'est-à-dire leadership adaptable, culture organisationnelle progressive, prochaine leadership de niveau, performance (financière & opérationnelle) et analyse décisionnelle & motif)

source: Career Counselling
es: Orientación profesional
fi: Uraneuvonta
fr: Orientation professionnelle

source: We walk with you in the journey to discovering what sets your soul on fire professionally.
es: Te acompañamos en el viaje para descubrir lo que enciende tu alma profesionalmente.
fi: Kävelemme kanssasi matkalla löytääksesi, mikä sytyttää sielusi tuleen ammattimaisesti.
fr: Nous vous accompagnons dans le voyage pour découvrir ce qui met le feu à votre âme professionnellement.

source: We help you develop skills that support your professional vision and add-ons aimed at realizing your professional goals such as communication, ethics, personal presentation & profiling, international opportunities search criteria, preparation for the next level, value branding per work outcome, knowing when to leave and winning negotiation skills for contracts.
es: Te ayudamos a desarrollar habilidades que apoyen tu visión profesional y como la comunicación, complementos dirigido a la realización de sus objetivos profesionales, tales ética, presentación personal y elaboración de perfiles, perfiles, criterios de búsqueda de oportunidades internacionales, preparación para el siguiente nivel, marca de valor por resultado de trabajo, saber cuándo irse y ganar habilidades de negociación para contratos.
fi: Autamme sinua kehittämään taitojasi, jotka tukevat ammatillista visiota ja lisäosia suunnattu toteuttaa ammatillisia tavoitteitasi, kuten viestintää, ethics, personal presentation & profiling, kansainvälisten mahdollisuuksien hakukriteerit, seuraavalle tasolle arvobrändäys työtulosta kohti, tietää milloin lähteä ja voittaa neuvottelutaidot sopimuksia.

source: The OBC volunteer program was created in honor of the Late Engineer Okore Booker Charles. This program has been carefully curated to reflect and inculcate the values that he lived by throughout his life in community service and social impact.
es: El programa de voluntariado de la OBC se creó en honor al difunto ingeniero Okore Booker Carlos. Este programa ha sido cuidadosamente curado para reflexionar e inculcar los valores por los que vivió a lo largo de su vida en el servicio comunitario y el impacto social.
fi: OBC-vapaaehtoisohjelma luotiin edesmenneen insinööri Okoren kunniaksi Booker Charles. Tämä ohjelma on huolellisesti kuratoitu pohtimaan ja juurruttamaan arvoja, joiden mukaan hän eli koko elämänsä yhdyskuntapalvelussa ja yhteiskunnallisessa vaikuttamisessa.
fr: Le programme de bénévolat OBC a été créé en l'honneur du regretté ingénieur Okore Booker Charles. Ce programme a été soigneusement conçu pour refléter et inculquer les valeurs qu'il a vécues tout au long de sa vie dans le service communautaire et l'impact social.

source: The OBC volunteer program will help you render assistance to underprivileged and underserved communities where you will experience traditional cultures and even get a chance to interact with rich wildlife all while supporting a good cause and creating a positive impact in the society.
es: El programa de voluntariado de la OBC te ayudará a prestar asistencia a los más desfavorecidos y comunidades desatendidas donde experimentará culturas tradicionales e incluso tener la oportunidad de interactuar con rica vida silvestre mientras apoya una buena causa y crea un ambiente positivo impacto en la sociedad.
fi: OBC-vapaaehtoisohjelma auttaa sinua auttamaan vähäosaisia ja alipalveltuja yhteisöjä, joissa voit kokea perinteisiä kulttuureja ja jopa mahdollisuuden olla vuorovaikutuksessa rikkaiden villieläinten kanssa samalla kun tuetaan hyvää asiaa ja luodaan myönteistä vaikutusta yhteiskuntaan.
fr: Le programme de volontariat OBC vous aidera à venir en aide aux personnes défavorisées et les communautés mal desservies où vous ferez l'expérience cultures traditionnelles et même avoir la chance d'interagir avec une faune riche tout en soutenant une bonne cause et en créant un climat positif impact dans la société.

source: We provide guidance and advice to individuals, groups and institutions about their investments and how to safeguard their interests and attain positive results. We further monitor the activities of these investments to ensure that there's full accountability and clarity on the utilisation of resources.
es: Brindamos orientación y asesoramiento a personas, grupos e instituciones sobre sus inversiones y cómo salvaguardar sus intereses y obtener resultados positivos. Supervisamos aún más las actividades de estas inversiones. para garantizar que haya total rendición de cuentas y claridad sobre la utilización de los recursos.
fi: Tarjoamme opastusta ja neuvoja yksityishenkilöille, ryhmille ja instituutioille heidän sijoituksensa ja miten etujaan ja saavuttaa myönteisiä tuloksia. Seuraamme edelleen näiden investointien toimintaa varmistaakseen täyden vastuullisuuden ja selkeyden resurssien käytöstä.
fr: Nous accompagnons et conseillons les individus, les groupes et les institutions sur leurs investissements et comment sauvegarder leurs intérêts et obtenir des résultats positifs. Nous surveillons en outre les activités de ces investissements pour s'assurer qu'il y a pleine responsabilisation et clarté sur l'utilisation des ressources.

source: We help you to build action oriented strategic plans, communication, business development, marketing and partnership strategies, internal policies and customer experience needs in the following industry categories and sectors:
es: Te ayudamos a construir planes estratégicos orientados a la acción, comunicación, desarrollo de negocios, marketing y estrategias de asociación, interna políticas y necesidades de experiencia del cliente en la siguiente industria categorías y sectores:
fi: Autamme sinua rakentamaan toimintalähtöisiä strategisia suunnitelmia, viestintää, liiketoiminnan kehittäminen, markkinointi ja kumppanuusstrategiat, sisäiset politiikat ja Asiakaskokemuksen tarpeita seuraavilla toimialoilla luokat ja alat:
fr: Nous vous aidons à construire des plans stratégiques orientés vers l'action, la communication, développement des affaires, stratégies de marketing et de partenariat, interne politiques et besoins d'expérience client dans l'industrie suivante catégories et secteurs :

source: Our areas of focus include: research, digitization, real estate & construction, corporate events (workshops and employee development programs), budgeting exercises and project fundraising initiatives.
es: Nuestras áreas de enfoque incluyen: investigación, digitalización, real inmobiliaria y construcción, eventos corporativos (talleres y desarrollo de empleados) programas), ejercicios de presupuestación y recaudación de fondos para proyectos iniciativas.
fi: Painopistealueitamme ovat: tutkimus, digitalisointi, tosielämä estate & construction, corporate events (workshops and employee development ohjelmat), budjetointiharjoituksia ja hankkeiden varainhankintaa aloitteita.
fr: Nos domaines d'intervention comprennent: la recherche, la numérisation, la réalité immobilier et construction, événements d'entreprise (ateliers et développement des employés programmes), exercices de budgétisation et collecte de fonds pour le projet initiatives.

source: Leadership i.e adaptable leadership, progressive organization culture, next level leadership, performance (financial & operational) and decision making analysis & design)
es: Liderazgo, es decir, liderazgo adaptable, progresivo cultura organizacional, liderazgo de siguiente nivel, desempeño (financiero y operativo) y análisis de toma de decisiones y diseño)
fi: Johtajuus eli mukautuva johtajuus, edistyksellinen organisaatiokulttuuri, seuraavan tason johtajuus, suorituskyky (taloudellinen ja toiminnallinen) ja päätöksentekoanalyysi & design)
fr: Leadership c'est-à-dire leadership adaptable, progressif culture organisationnelle, leadership de niveau supérieur, performance (financière & opérationnelle) et analyse décisionnelle & motif)

source: We are all about accountability and convenience. Curious?
es: Nos preocupamos por la responsabilidad y la conveniencia. ¿Curioso?
fi: Olemme kaikki vastuussa ja mukavuudessa. Utelias?
fr: Nous sommes tout au sujet de la responsabilité et de la commodité. Curieux?

source: LET'S TALK
es: HABLEMOS
fi: PUHUTAAN
fr: PARLONS

source: Home
es: Hogar
fi: Koti
fr: Maison

source: Who We Are
es: Quienes Somos
fi: Keitä olemme
fr: Qui nous sommes

source: About Us
es: Sobre nosotros
fi: Meistä
fr: À propos de nous

source: Services
es: Servicios
fi: Palvelut
fr: Prestations de service

source: Programs
es: Programas
fi: Ohjelmat
fr: Programmes

source: News
es: Noticias
fi: Uutiset
fr: Nouvelles

source: Join Us
es: Únete a nosotros
fi: Liity meihin
fr: Rejoignez-nous

source: News Page
es: Página de noticias
fi: Uutissivu
fr: Actualités

source: The OBC Volunteer program is ideal for students and practitioners and aims to place enthusiastic volunteers in the right spaces to make a positive impact on the lives of underserved people within local African Communities. The OBC volunteers get to interact with the local communities and immerse themselves in rich African culture. Not only do they experience the fulfillment of making positive changes to these underprivileged communities, they also develop skills through a multicultural lens and a global spectrum.
es: El programa de Voluntariado OBC es ideal para estudiantes y practicantes y tiene como objetivo colocar Voluntarios entusiastas en los espacios adecuados para hacer una impacto positivo en la vida de personas marginadas dentro de las comunidades africanas locales. la OBC los voluntarios pueden interactuar con las comunidades locales y sumergirse en la rica cultura africana cultura. No solo ellos experimentar el cumplimiento de hacer cambios positivos en these underprivileged communities, también desarrollan habilidades a través de una lente multicultural y una espectro mundial.
fi: OBC Volunteer -ohjelma on ihanteellinen opiskelijoille ja harjoittajia ja pyrkii sijoittamaan innokkaita vapaaehtoisia oikeissa tiloissa tekemään a positiivinen vaikutus elämään alipalveltuja ihmisiä paikallisissa afrikkalaisissa yhteisöissä. OBC vapaaehtoiset saavat olla tekemisissä paikalliset yhteisöt ja uppoutua rikkaaseen afrikkalaiseen kulttuuri. Eivät vain he kokea positiivisten muutosten tekemisen täyttymys nämä vähäosaiset yhteisöt, he myös kehittävät taitoja monikulttuurisen linssin kautta ja a globaali spektri.
fr: Le programme de bénévolat OBC est idéal pour les étudiants et praticiens et vise à placer bénévoles enthousiastes dans les bons espaces pour faire un impact positif sur la vie des personnes mal desservies au sein des communautés africaines locales. L'OBC les bénévoles peuvent interagir avec les communautés locales et s'immerger dans la richesse africaine Culture. Non seulement ils faire l'expérience d'apporter des changements positifs à ces communautés défavorisées, ils développent également des compétences à travers une lentille multiculturelle et une spectre mondial.

source: The OBC Volunteer program is open to individuals across the board from different backgrounds such as
es: El programa de Voluntarios de OBC está abierto a personas de todos los ámbitos de diferentes antecedentes como
fi: OBC Volunteer -ohjelma on avoin kaikille henkilöille alkaen erilaisia taustoja, esim
fr: Le programme de bénévolat OBC est ouvert aux personnes de tous horizons, de différents horizons tels que

source: General Health Care
es: Atención médica general
fi: Yleinen terveydenhuolto
fr: Soins de santé généraux

source: Urban Planning and Development
es: Urbanismo y Desarrollo
fi: Kaupunkisuunnittelu ja -kehitys
fr: Urbanisme et Développement

source: Economic Empowerment
es: Empoderamiento económico
fi: Taloudellinen vaikutusvalta
fr: Émancipation économique

source: Water and Sanitation
es: Agua y sanitización
fi: Vesi ja sanitaatio
fr: Eau et Assainissement

source: Eco Farming
es: agricultura ecológica
fi: Ekoviljely
fr: Agriculture écologique

source: Mental Health
es: Salud mental
fi: Mielenterveys
fr: Santé mentale

source: Youth
es: Juventud
fi: Nuoriso
fr: Jeunesse

source: Education
es: Educación
fi: koulutus
fr: Éducation

source: Child Care
es: Cuidado de los niños
fi: Lastenhoito
fr: Garde d'enfants

source: Elderly Care
es: Cuidado de los ancianos
fi: Vanhustenhoito
fr: Les soins aux personnes âgées

source: We give our volunteers a detailed overview of ELAN Dome's volunteer missions and expectations to enable them to be confident and knowledgeable about the causes they are undertaking and to cultivate the motivation and enthusiasm that encouraged them to volunteer in the first place.
es: Brindamos a nuestros voluntarios una descripción detallada de ELAN Dome misiones voluntarias y expectativas que les permitan tener confianza y conocimientos sobre las causas que son emprender y cultivar la motivación y el entusiasmo que Los animó a ser voluntarios en primer lugar.
fi: Annamme vapaaehtoisillemme yksityiskohtaisen yleiskatsauksen ELAN Domesta vapaaehtoistehtävät ja odotuksia, jotta he voivat olla varmoja ja asiantuntevia niiden syistä yritystä ja kasvattaa sitä motivaatiota ja innostusta rohkaisi heitä vapaaehtoistyöhön ensinnäkin.
fr: Nous donnons à nos volontaires un aperçu détaillé des activités d'ELAN Dome missions bénévoles et attentes pour leur permettre d'être confiants et bien informés sur les causes qu'ils sont entreprendre et de cultiver la motivation et l'enthousiasme qui les a encouragés à faire du bénévolat en premier lieu.

source: Apply to be a volunteer
es: Aplicar para ser voluntario
fi: Hae vapaaehtoiseksi
fr: Postuler pour devenir bénévole

source: We support local citizens in the diaspora and international development organizations with all their investment needs. Using our knowledge about the local market we prioritize efficient and seamless operations that protect them from negative eventualities. Through our investment supervision services, we offer our local and international investor's representative service and supervision of their investment projects thereby enhancing accountability.
es: Apoyamos a los ciudadanos locales en la diáspora y organizaciones internacionales de desarrollo con toda su inversión necesidades. Utilizando nuestro conocimiento sobre el mercado local priorizar operaciones eficientes y fluidas que protejan de eventualidades negativas. A través de nuestra inversión servicios de supervisión, ofrecemos nuestro local y servicio de representación de inversores internacionales y supervisión de sus proyectos de inversión mejorando así responsabilidad.
fi: Tuemme paikallisia kansalaisia diasporassa ja kansainväliset kehitysjärjestöt kaikkine investoinneineen tarpeisiin. Käytämme paikallisia markkinoita koskevia tietojamme priorisoi tehokkaat ja saumattomat toiminnot, jotka suojaavat niitä negatiivisilta tilanteilta. Investointimme kautta valvontapalveluita tarjoamme paikallisia ja kansainvälisten sijoittajien edustuspalvelu ja investointihankkeidensa valvontaa, mikä tehostaa vastuullisuus
fr: Nous soutenons les citoyens locaux de la diaspora et organisations internationales de développement avec tout leur investissement Besoins. Grâce à notre connaissance du marché local, nous donner la priorité à des opérations efficaces et transparentes qui protègent les protéger des éventualités négatives. Grâce à notre investissement services de supervision, nous offrons nos services locaux et responsabilité.

source: These services range from
es: Estos servicios van desde
fi: Nämä palvelut vaihtelevat
fr: Ces prestations vont de

source: Regularly inspecting investments sites in order to control the progress.
es: Inspeccionar regularmente los sitios de inversión para controlar el progreso.
fi: Tarkastetaan säännöllisesti sijoituskohteita edistymisen valvomiseksi.
fr: Inspecter régulièrement les sites d'investissements afin de contrôler l'avancement.

source: Verifying work carried out contractors.
es: Verificación de trabajos realizados por contratistas.
fi: Urakoitsijoiden suorittamien töiden tarkistaminen.
fr: Vérification des travaux effectués par les entrepreneurs.

source: Generating post-completion documentation.
es: Generación de documentación posterior a la finalización.
fi: Valmistumisen jälkeisen dokumentaation luominen.
fr: Génération de la documentation post-achèvement.

source: Taking part in coordination meetings.
es: Participar en las reuniones de coordinación.
fi: Osallistuminen koordinointikokouksiin.
fr: Participation aux réunions de coordination.

source: Preparing and taking part in the final handover of the investment to the investor.
es: Preparar y participar en la entrega final de la inversión a la inversor.
fi: Investoinnin lopullisen luovutuksen valmistelu ja osallistuminen sijoittaja.
fr: Préparer et participer à la remise finale de l'investissement au investisseur.

source: We make our clients part of the journey even while they are away by completely involving them in every juncture of our processes.
es: Hacemos que nuestros clientes sean parte del viaje incluso cuando están fuera involucrándolos completamente en cada coyuntura de nuestros procesos.
fi: Otamme asiakkaamme osaksi matkaa myös heidän ollessaan poissa ottaa heidät täysin mukaan prosessiemme jokaiseen vaiheeseen.
fr: Nous faisons participer nos clients au voyage même lorsqu'ils sont absents en en les impliquant complètement à chaque étape de nos processus.
