Repository: elandev22/elandome
Catalog: locale/*/LC_MESSAGES/django.po
Languages: es, fi, fr

source: We handle all aspects pertaining to the planning and execution of projects. We monitor projects through the stages of project initiation, planning, execution, and closure to make sure that the objectives of the project are fulfilled. We manage projects effectively so that they are completed on time, to the set specification and within the stipulated budgets. With our strong grasp of various modes of project delivery we can identify and recommend the most appropriate project delivery approach for projects.
es: Nos ocupamos de todos los aspectos relacionados con la planificación y ejecución de proyectos. Monitoreamos proyectos a través de las etapas de iniciación del proyecto, planificación, ejecución y cierre para asegurarse de que el se cumplen los objetivos del proyecto. Gestionamos proyectos efectivamente para que se completen en tiempo, a la especificación establecida y dentro del plazo estipulado presupuestos Con nuestra sólida comprensión de varios modos de entrega del proyecto podemos identificar y recomendar el enfoque para los proyectos.
fi: Hoidamme kaikki suunnitteluun liittyvät asiat hankkeiden toteuttaminen. Seuraamme projekteja läpi hankkeen aloitus-, suunnittelu-, toteuttaminen ja sulkeminen varmistaaksesi, että hankkeen tavoitteet täyttyvät. Hoidamme projekteja tehokkaasti, jotta ne valmistuvat aika, asetettujen eritelmien mukaisesti ja määrättyjen rajojen sisällä budjetit. Meidän vahva käsitys eri projektien toteutustavat voimme tunnistaa ja suositella sopivin projektitoimitus lähestymistapa hankkeisiin.
fr: Nous nous occupons de tous les aspects relatifs à la planification et exécution des projets. Nous suivons les projets à travers les étapes de lancement du projet, de planification, l'exécution et la clôture pour s'assurer que le objectifs du projet sont atteints. Nous gérons des projets efficacement afin qu'ils soient terminés sur temps, au cahier des charges et dans les délais stipulés budgets. Grâce à notre solide maîtrise de divers modes de livraison du projet, nous pouvons identifier et recommander les livraison de projet la plus appropriée démarche pour les projets.

source: Some of our project management services include
es: Algunos de nuestros servicios de gestión de proyectos incluyen
fi: Osa projektinhallintapalveluistamme sisältää mm
fr: Certains de nos services de gestion de projet comprennent

source: Defining program goals and project scope
es: Definición de los objetivos del programa y el alcance del proyecto
fi: Ohjelman tavoitteiden ja projektin laajuuden määrittely

source: Identifying project delivery methods
es: Identificar los métodos de entrega del proyecto.
fi: Hankkeen toimitusmenetelmien tunnistaminen

source: Outlining project schedules
es: Esbozar los cronogramas del proyecto
fi: Projektien aikataulujen hahmottaminen

source: Cost management
es: Manejo de costos
fi: Kulujen hallinta
fr: La gestion des coûts

source: Developing and Evaluating proposals
es: Desarrollo y evaluación de propuestas
fi: Ehdotusten laatiminen ja arviointi

source: Managing Consulting Services
es: Gestión de Servicios de Consultoría
fi: Konsultointipalveluiden johtaminen

source: Developing Contract Documentation
es: Desarrollo de la documentación del contrato
fi: Sopimusdokumentaation kehittäminen

source: Drafting and generating project reports
es: Redacción y generación de informes de proyectos.
fi: Projektiraporttien laatiminen ja tuottaminen

source: Workshops provide an avenue to explore current topics, hands-on training, and practical application. ELAN Dome Consultants offers a wide array of interactive and dynamic workshops and training sessions that can be easily customized to suit different individuals, groups and organizations. (Corporate Organizations, Educational Institutions, NGOs, CBOs etc)
es: Los talleres brindan una vía para explorar temas actuales, capacitación práctica y aplicación práctica. ELAN Dome Consultants ofrece una amplia gama de servicios interactivos y talleres dinámicos y sesiones de formación que se puede personalizar fácilmente para adaptarse a diferentes personas, grupos y organizaciones. (Corporativo Organizaciones, Instituciones Educativas, ONGs, CBOs etc)
fi: Työpajat tarjoavat mahdollisuuden tutustua ajankohtaisiin aiheisiin, käytännön koulutusta ja käytännön soveltamista. ELAN Dome Consultants tarjoaa laajan valikoiman interaktiivisia voidaan helposti räätälöidä eri henkilöille sopivaksi, ryhmät ja järjestöt. (Yritys jne)
fr: Les ateliers permettent d'explorer des sujets d'actualité, formation pratique et application pratique. ELAN Dome Consultants propose un large éventail de et des ateliers dynamiques et des sessions de formation qui peut être facilement personnalisé pour convenir à différentes personnes, groupes et organisations. (Entreprise Organisations, établissements d'enseignement, ONG, organisations communautaires etc)

source: These workshops and training sessions focus on respective areas as requested by our clients. They range from personal development areas to professional improvement areas like leadership training and change management. They are particularly very beneficial to organizations that would like to optimize their manpower and create unison within different departments.
es: Estos talleres y sesiones de formación se centran en áreas respectivas según lo solicitado por nuestros clientes. Van desde áreas de desarrollo personal hasta áreas de mejora profesional como capacitación en liderazgo y gestión del cambio. Están particularmente muy beneficioso para organizaciones que deseen optimizar su mano de obra y crear unísono dentro de diferentes departamentos.
fi: Nämä työpajat ja koulutustilaisuudet keskittyvät vastaavat alueet asiakkaidemme pyynnöstä. Ne vaihtelevat henkilökohtaisesta kehityksen alueista ammatilliset kehittämisalueet, kuten johtamiskoulutus ja muutoksenhallinta. He ovat particularly very beneficial to organisaatioille, jotka haluavat optimoida työvoimaansa ja luoda yhtenäisyyttä eri sisällä osastot.
fr: Ces ateliers et sessions de formation portent sur domaines respectifs à la demande de nos clients. Ils vont des domaines de développement personnel à domaines de perfectionnement professionnel comme formation au leadership et conduite du changement. Elles sont particulièrement très bénéfique pour organisations qui souhaitent optimiser leur main-d'œuvre et créer l'unisson au sein de différents départements.

source: We work with individuals to help them identify what's most important to them and what they want from their future and then support them to achieve these goals. Our Career Counseling program is beneficial in numerous ways.
es: Trabajamos con individuos para ayudarlos a identificar qué es lo más importante para ellos y lo que quieren de su futuro y luego apoyarlos para lograr estos objetivos. Nuestra Orientación Laboral programa es beneficioso de muchas maneras.
fi: Työskentelemme ihmisten kanssa auttaaksemme heitä tunnistamaan, mikä on tärkeintä heille tärkeitä ja mitä he haluavat heidän tulevaisuutensa ja sitten tukea heitä saavuttamaan näitä tavoitteita. Uraneuvontamme ohjelmasta on hyötyä monella tapaa.
fr: Nous travaillons avec les individus pour les aider à identifier ce qui est le plus important pour eux et ce qu'ils veulent de leur avenir, puis les aider à atteindre ces objectifs. Notre orientation professionnelle programme est bénéfique à bien des égards.

source: We help you fully explore your interests
es: Te ayudamos a expandir tus horizontes.
fi: Autamme sinua tutkimaan kiinnostuksen kohteitasi täysin
fr: Nous vous aidons à explorer pleinement vos intérêts

source: Through career counseling our participants are able to sift through factors that actually make them want a certain career and angle plus common influential factors. Our career counselors also question and support choices with all factors considered.
es: A través de la orientación profesional, nuestros participantes pueden seleccionar a través de factores que realmente hacen ellos quieren una cierta carrera y ángulo más influencia común factores Nuestros consejeros de carrera también cuestionar y apoyar elecciones con todos los factores consideró.
fr: Grâce à l'orientation professionnelle, nos participants sont en mesure de passer au crible à travers des facteurs qui font réellement ils veulent une certaine carrière et un certain angle ainsi qu'une influence commune ils veulent une certaine carrière et un certain angle ainsi qu'une influence commune les facteurs. Nos conseillers en carrière également remettre en question et soutenir les choix avec tous les facteurs considéré.

source: We clarify your professional objectives.
es: Aclaramos tus objetivos profesionales.
fi: Selvitämme ammatillisia tavoitteitasi.
fr: Nous clarifions vos objectifs professionnels.

source: In order to break barriers and achieve success within your chosen field it is paramount to have set objectives that guide your journey. Through career counselling we help you create a roadmap by helping you set these objectives and providing extensive insight on the advantages and disadvantages of each action.
es: Para romper barreras y lograr el éxito dentro de su campo elegido es primordial tener establecer objetivos que guíen su viaje. a través de la carrera asesoramiento te ayudamos a crear una hoja de ruta ayudándote usted establece estos objetivos y proporciona una visión amplia sobre las ventajas y desventajas de cada acción.

source: We help you expand your horizons.
es: Te ayudamos a expandir tus horizontes.
fi: Autamme sinua laajentamaan näköalojasi.
fr: Nous vous aidons à élargir vos horizons.

source: Through our career counseling program you will gain a wider perspective of the career options and choices you have. You will be able to explore more career options, review the opportunities that present themselves and settle on the best fit.
es: A través de nuestro programa de orientación profesional obtendrá una mayor perspectiva de las opciones de carrera y opciones que tienen. Podrás explorar más opciones de carrera, revise las oportunidades que se presentan y se deciden por el mejor ajuste.
fi: Uraneuvontaohjelmamme kautta saat laajemman näkökulmasta uravaihtoehtoihin ja valintoja sinulla on. Voit tutkia lisää uravaihtoehtoja, tarkista mahdollisuudet jotka esittelevät itsensä ja sopivat parhaiten.

source: Still want to know more? Let's Talk
es: ¿Todavía quieres saber más? Hablemos
fi: Haluatko silti tietää lisää? Puhutaan
fr: Vous voulez encore en savoir plus ? Parlons

source: Our
es: Nuestro
fi: Meidän
fr: Notre

source: Process
es: Proceso
fi: Prosessi
fr: Traiter

source: We prioritize efficient and seamless operations that cushion our clients from the hustle and bustle of international regulatory requirements, cultural pressures and international logistics. We transfer these responsibilities from you to us given our deep understanding of the cultural contexts, legal requirements and local dynamics. We want to make sure everything is fast, simple, under control, pleasant, experiential, memorable and impactful.
es: Damos prioridad a operaciones eficientes y fluidas que Amortiguar a nuestros clientes del ajetreo. y el bullicio de los requisitos reglamentarios internacionales, presiones culturales e internacionales logística. Transferimos estas responsabilidades de usted para nosotros dada nuestra profunda comprensión de los contextos culturales, los requisitos legales y locales dinámica. Queremos asegurarnos de que todo es rápido, sencillo, bajo control, agradable, experiencial, memorable e impactante.
fi: Etusijalle asetamme tehokkaan ja saumattoman toiminnan suojata asiakkaitamme hälinästä ja kansainvälisten sääntelyvaatimusten vilske, kulttuuriset paineet ja kansainväliset logistiikka. Siirrämme nämä vastuut sinulta meille syvän ymmärryksemme ansiosta kulttuurisista konteksteista, lakisääteisistä vaatimuksista ja paikallisista dynamiikka. Haluamme varmistaa kaiken on nopea, yksinkertainen, hallinnassa, miellyttävä, kokemuksellinen, ikimuistoinen ja vaikuttava.
fr: Nous accordons la priorité à des opérations efficaces et transparentes qui protéger nos clients de l'agitation et l'agitation des exigences réglementaires internationales, pressions culturelles et internationales logistique. Nous vous transférons ces responsabilités à nous compte tenu de notre profonde compréhension des contextes culturels, des exigences légales et des dynamique. Nous voulons nous assurer que tout est rapide, simple, maîtrisé, agréable, expérientiel,mémorable et percutant.

source: What We Do
es: Lo que hacemos
fi: Mitä me teemme
fr: Ce que nous faisons

source: Project focussed.
es: Proyecto enfocado.
fi: Projektiin keskittynyt.
fr: Axé sur le projet.

source: People centred.
es: Centrado en las personas.
fi: Ihmisten keskiössä.
fr: Centré sur les personnes.

source: Results driven.
es: Orientado a resultados.
fi: Tulokset ajettu.
fr: Centré sur les personnes.

source: Interlink international students, individual social/organizational groups, universities and boarding schools to prospective community programs, initiatives, organizations and projects.
es: Interlink estudiantes internacionales, sociales individuales/grupos organizativos, universidades e internados a la comunidad prospectiva programas, iniciativas, organizaciones y proyectos.
fi: Interlink kansainväliset opiskelijat, yksittäiset sosiaaliset/organisaatioryhmät, yliopistot ja sisäoppilaitoksista tulevalle yhteisölle ohjelmia, aloitteita, järjestöjä ja hankkeita.
fr: Interlink étudiants internationaux, social individuel/groupes organisationnels, universités et internats à la communauté potentielle programmes, initiatives, organisations et projets.

source: Provide individuals with an experiential and international learning exposure service that is second to none in terms of immersion into societal contexts that are unique and rich.
es: Proporcionar a las personas una experiencia y servicio de exposición de aprendizaje internacional que es segundo a ninguno en términos de inmersión en contextos sociales que son únicos y ricos.
fi: Tarjoa yksilöille kokemuksellista ja kansainvälinen oppimisen altistumispalvelu, joka on toinen ei mihinkään yhteiskunnallisiin konteksteihin uppoamisen kannalta jotka ovat ainutlaatuisia ja rikkaita.
fr: Offrir aux individus une expérience et international learning exposure service that is second à rien en termes d'immersion dans des contextes sociétaux uniques et riches.

source: Offer project management services to in all aspects (community based organizations, corporate facing and event oriented)
es: Ofrecer servicios de gestión de proyectos en todos los aspectos (organizaciones comunitarias, corporativas y orientado a eventos)
fi: Tarjoa projektinhallintapalveluita kaikilla osa-alueilla (yhteisöpohjaiset organisaatiot, yrityskohtaiset ja tapahtumasuuntautunut)
fr: Offrir des services de gestion de projet à tous les aspects (organisations communautaires, face aux entreprises et événementiel)

source: Organize exceptional adventurous activities for volunteers across Africa- networking, thrill, food & culture etc.
es: Organizar actividades de aventura excepcionales para Voluntarios en toda África: redes, emoción, comida y cultura etc.
fi: Järjestä poikkeuksellisia seikkailunhaluisia aktiviteetteja vapaaehtoisia eri puolilla Afrikkaa - verkostoitumista, jännitystä, ruokaa ja kulttuuria jne.
fr: Organisez des activités d'aventure exceptionnelles pour bénévoles à travers l'Afrique - réseautage, sensations fortes, nourriture et culturelle etc...

source: Provide 360° placement services to assist interested individuals in all facets of enrolling in international internship and exchange programs.
es: Proporcionar servicios de colocación de 360° para ayudar a los interesados individuos en todas las facetas de inscribirse en Programas de intercambio y pasantías internacionales.
fi: Tarjoa 360°-sijoituspalveluita kiinnostuneiden auttamiseksi yksilöitä kaikilla ilmoittautumisen osa-alueilla kansainvälisiä harjoittelu- ja vaihto-ohjelmia.
fr: Fournir des services de placement à 360° pour aider les personnes intéressées les individus dans toutes les facettes de l'inscription à programmes de stages et d'échanges internationaux.

source: Provide organizational programming through the creation of functional organization designs, implementation, evaluation and support
es: Proporcionar programación organizacional a través de la creación de diseños de organización funcional, implementación, evaluación y apoyo
fi: Tarjoa organisaation ohjelmointia toiminnallisten organisaatiosuunnitelmien luominen, täytäntöönpano, arviointi ja tuki
fr: Offrir une programmation organisationnelle par le création de schémas d'organisation fonctionnelle, mise en œuvre, évaluation et accompagnement

source: Our Portfolio
es: Nuestro portafolio
fi: Portfoliomme
fr: Notre portfolio

source: The OBC volunteer program will help you render assistance to underprivileged and underserved communities where you will experience traditional cultures and even get a chance to interact with rich wildlife all while supporting a good cause and creating a positive impact in the society.
es: El programa de voluntariado de la OBC te ayudará a rendir asistencia a comunidades desfavorecidas y desatendidas donde usted experiencia culturas tradicionales e incluso tener la oportunidad de interactuar con rica vida silvestre mientras apoya una buena causa y crea un ambiente positivo impacto en la sociedad.
fi: OBC-vapaaehtoisohjelma auttaa sinua tekemään apua heikommassa asemassa oleville ja vähäosaisille yhteisöille missä haluat kokea perinteisiä kulttuureja ja jopa mahdollisuuden olla vuorovaikutuksessa rikkaiden villieläinten kanssa samalla kun tuetaan hyvää asiaa ja luodaan myönteistä vaikutusta yhteiskuntaan.
fr: Le programme de bénévolat OBC vous aidera à rendre assistance aux communautés défavorisées et mal desservies où vous vivre cultures traditionnelles et même avoir la chance d'interagir avec une faune riche tout en soutenant une bonne cause et en créant un climat positif impact dans la société.

source: Our areas of focus include: research, digitization, real estate & construction, corporate events (workshops and employee development programs), budgeting exercises and project fundraising initiatives.
es: Nuestras áreas de enfoque incluyen: investigación, digitalización, inmobiliario y construcción, eventos corporativos (talleres y empleados) programas de desarrollo), ejercicios de presupuestación y recaudación de fondos para proyectos initiatives.
fi: Painopistealueitamme ovat: tutkimus, digitalisointi, kiinteistöt ja rakentaminen, yritystapahtumat (työpajat ja työntekijä kehitysohjelmat), budjetointiharjoituksia ja hankkeiden varainhankintaa aloitteita.
fr: Nos domaines d'intervention comprennent : la recherche, la numérisation, immobilier & construction, événements d'entreprise (ateliers et employés programmes de développement), exercices de budgétisation et collecte de fonds pour le projet initiatives.

source: We walk with you the journey to discovering what sets your soul on fire professionally.
es: Caminamos contigo el viaje para descubrir lo que prende fuego a tu alma profesionalmente.
fi: Kävelemme kanssasi matkalla löytääksesi, mikä sytyttää sielusi tuleen ammattimaisesti
fr: Nous parcourons avec vous le voyage pour découvrir ce qui met le feu à votre âme professionnellement.

source: We help you develop skills that support your professional vision and ad-ons aimed at realizing your professional goals such as communication, ethics, personal presentation & profiling, international opportunities search criteria, preparation for the next level, value brnding per work outcome, knowing when to leave and winning negotiation skills for contracts.
es: Te ayudamos a desarrollar habilidades que apoyen tu visión profesional y complementos destinados a la realización de sus objetivos profesionales, tales como la comunicación, ética, presentación personal y elaboración de perfiles, criterios de búsqueda de oportunidades internacionales, preparación para el siguiente nivel, creación de valor por resultado de trabajo, saber cuándo irse y ganar habilidades de negociación para contratos.
fi: Autamme sinua kehittämään taitojasi, jotka tukevat sinua ammatillinen visio ja lisäosat toteuttaa ammatillisia tavoitteitasi, kuten viestintää,etiikka, henkilökohtainen esittely ja profilointi, kansainvälisten mahdollisuuksien hakukriteerit, valmistelu seuraavalle tasolle, arvon tuottaminen työtulosta kohti, tietää milloin lähteä ja voittaa neuvottelutaidot sopimuksia.
fr: Nous vous aidons à développer des compétences qui soutiennent votre vision professionnelle et compléments destinés à réaliser vos objectifs professionnels tels que la communication, éthique, présentation et profilage personnels, critères de recherche d'opportunités internationales, préparation pour le niveau suivant, valeur brnding par résultat de travail, savoir quand partir et acquérir des compétences de négociation pour contrats.

source: Find Out More
es: Saber más
fi: Lue lisää
fr: En savoir plus

source: Ground Floor
fr: Rez-de-chaussée

source: Additionally, we advise organisations on key strategic issues by leveraging on our industry knowledge and analytical prowess, to enable them make informed decisions. This service enables them to achieve their business objectives by capitalising on opportunities and being prepared to mitigate potential risks.
fr: De plus, nous conseillons les organisations sur les stratégies clés problèmes en tirant parti de notre connaissance de l'industrie et prouesses analytiques, pour leur permettre de prendre des les décisions. Ce service leur permet de réaliser leur objectifs commerciaux en capitalisant sur les opportunités et être prêt à atténuer les risques potentiels.

source: We are the first choice custodians of your projects and resources on ground. We source for quality and competitive resource plans, quotations, unique development plans and bespoke designs that are fairly priced and work with reputable experts to execute your vision and deliver beyond the expected outcomes.
fr: Nous sommes les dépositaires de premier choix de vos projets et ressources sur terrain. Nous recherchons des plans de ressources de qualité et compétitifs, des devis, développement unique des plans et des conceptions sur mesure à un prix travaillez avec des experts réputés pour exécuter votre vision et livrer au-delà du vision et livrer au-delà du résultats attendus.

source: We are the first choice custodians of your projects and resources on ground. We source for quality and competitive resource plans, quotations, unique development plans and bespoke designs that are fairly priced and work with reputable experts to execute your vision and deliver beyond the expected outcomes.
fr: Nous sommes les dépositaires de premier choix de vos projets et ressources sur terrain. Nous recherchons des plans de ressources de qualité et compétitifs, des devis, développement unique des plans et des conceptions sur mesure à un prix travaillez avec des experts réputés pour exécuter votre vision et livrer au-delà du vision et livrer au-delà du résultats attendus.

source: Supporting managing the entire investment process.
fr: Soutenir la gestion de l'ensemble du processus d'investissement.

source: Define program goals and project scope
fr: Définir les objectifs du programme et la portée du projet

source: Identify project delivery methods
fr: Identifier les méthodes de livraison du projet

source: Outline project schedules
fr: Planifier les calendriers du projet

source: Develop and Evaluate proposals
fr: Élaborer et évaluer des propositions

source: Manage Consulting Services
fr: Gérer les services de conseil

source: Develop Contract Documentation
fr: développer la documentation contractuelle
