Repository: elandev22/elandome
Catalog: locale/*/LC_MESSAGES/django.po
Languages: es, fi, fr

source: Draft and generate project reports
fr: Rédiger et générer des rapports de projet

source: In order to break barriers and achieve success within your chosen field it is paramount to have set objectives that guide your journey. Through career we help you create a roadmap by helping you set these objectives and providing extensive insight on the advantages and disadvantages of each action.
fr: Afin de briser les barrières et de réussir au sein de votre domaine choisi, il est primordial d'avoir fixez-vous des objectifs qui guident votre cheminement. Grâce à la carrière, nous vous aider à créer une feuille de route en aidant vous fixez ces objectifs et fournissez des informations détaillées sur les avantages et les inconvénients de chaque acte.

source: Through our career counseling program you will gain a wider perspective of the career options and choices they have. You will be able to explore more career options, review the opportunities that present themselves and settle on the best fit.
fr: Grâce à notre programme d'orientation professionnelle, vous bénéficierez d'une plus grande perspective des options de carrière et les choix qu'ils ont. Vous pourrez explorer davantage options de carrière, examinez les opportunités qui se présentent et choisissent le meilleur ajustement.

source: We help you develop skills that support your professional vision and add-ons aimed at realizing your professional goals such as communication, ethics, personal presentation & profiling, international opportunities search criteria, preparation for the next level, value branding per work outcome, knowing when to leave and winning negotiation skills for contracts.
fi: Autamme sinua kehittämään taitojasi, jotka tukevat sinua ammatillinen visio ja lisäosat toteuttaa ammatillisia tavoitteitasi, kuten viestintää,etiikka, henkilökohtainen esittely ja profilointi, kansainvälisten mahdollisuuksien hakukriteerit, seuraavalle tasolle arvobrändäys työtulosta kohti, tietää milloin lähteä ja voittaa neuvottelutaidot sopimuksia.

source: Supporting & managing the entire investment process.
fi: Koko sijoitusprosessin tukeminen ja hallinta.

source: Through career counselling our participants are able to sift through factors that actually make them want a certain career and angle plus common influential factors. Our career counselors also question and support choices with all factors considered.
fi: Uraneuvonnan kautta osallistujamme voivat seuloa tekijöiden kautta, jotka todella tekevät he haluavat tietyn uran ja näkökulman sekä yhteisen vaikutusvallan tekijät. Meidän uraneuvojamme myös kyseenalaistaa ja tukea valintoja kaikilla tekijöilläharkittu.
