Repository: elandev22/elandome
Catalog: locale/*/LC_MESSAGES/django.po
Languages: es, fi, fr

source: This package takes students through an experiential journey of personal growth that enables them to develop new skills, acquire a global perspective, meet new people and even improve their career prospects
es: Este paquete lleva a los estudiantes a través de un viaje experiencial de crecimiento personal que les permita desarrollar nuevos habilidades, adquirir una perspectiva global, conocer gente nueva y incluso mejorar sus perspectivas de carrera
fi: Tämä paketti vie opiskelijat kokemusmatkalle henkilökohtaista kasvua, joka antaa heille mahdollisuuden kehittää uutta taitoja, saada globaali näkökulma, tavata uusia ihmisiä ja jopa parantaa uranäkymiään
fr: Ce forfait emmène les étudiants à travers un voyage expérientiel de croissance personnelle qui leur permet de développer de nouvelles compétences, acquérir une perspective globale, rencontrer de nouvelles personnes et même améliorer leurs perspectives de carrière

source: Employees
es: Empleados
fr: Des employés

source: Our employee program is a planned and managed initiative that seeks to motivate and enable employees to develop design thinking skills, increase employee engagement in problem solving and enhance employee retention through self leadership.
es: Nuestro programa de empleados es una iniciativa planificada y gestionada que busca motivar y capacitar a los empleados para desarrollar habilidades de pensamiento de diseño, aumentar el compromiso de los empleados en resolución de problemas y mejorar la retención de empleados a través de auto liderazgo.
fi: Työntekijäohjelmamme on suunniteltu ja johdettu aloite joka pyrkii motivoimaan ja mahdollistamaan työntekijöiden kehittyminen suunnittele ajattelutaitoja, lisää työntekijöiden sitoutumista ongelmanratkaisuun ja työntekijöiden pysyvyyden parantamiseen itsejohtajuutta.
fr: Notre programme pour les employés est une initiative planifiée et gérée qui vise à motiver et à permettre aux employés de se développer compétences en matière de conception, accroître l'engagement des employés dans résoudre des problèmes et améliorer la rétention des employés grâce à auto-direction.

source: Individuals
es: Individuos
fi: Yksilöt
fr: Personnes

source: This package is designed for individuals looking to immerse themselves in a journey of self actualization and allows individuals to develop a deep understanding of the culture, community and country where they are volunteering, and they are highly rewarding.
es: Este paquete está diseñado para personas que buscan sumergirse en un viaje de autorrealización y permite a los individuos desarrollar un profundo comprensión de la cultura, la comunidad y el país donde son voluntarios y son muy gratificantes.
fi: Tämä paketti on suunniteltu henkilöille, jotka haluavat uppoutua itsensä toteuttamisen matkalla ja antaa yksilöille mahdollisuuden kehittää syvä ymmärrystä kulttuurista, yhteisöstä ja maasta he tekevät vapaaehtoistyötä ja ovat erittäin palkitsevia.
fr: Ce forfait est conçu pour les personnes qui cherchent à s'immerger eux-mêmes dans un voyage d'auto-actualisation et permet aux individus de développer une profonde compréhension de la culture, de la communauté et du pays où ils font du bénévolat et ils sont très gratifiants.

source: Teachers
es: Profesores
fi: Opettajat
fr: Enseignants

source: The teachers' package allows teachers to bring their knowledge and skills to eager but underserved children. to help improve educational practices and processes.
es: El paquete de profesores permite a los profesores aportar sus conocimientos y habilidades a niños ansiosos pero desatendidos. ayudar a mejorar las prácticas educativas y procesos.
fi: Opettajien paketin avulla opettajat voivat tuoda tietonsa ja taitonsa mukaan innokkaita mutta alipalvelustettuja lapsia. auttaa parantamaan koulutuskäytäntöjä ja prosessit.
fr: Le kit enseignants permet aux enseignants d'apporter leurs connaissances et leurs compétences à enfants enthousiastes mais mal desservis. contribuer à améliorer les pratiques éducatives et processus.

source: Be a part of our community
es: Sea parte de nuestra comunidad
fi: Ole osa yhteisöämme
fr: Faites partie de notre communauté

source: Are you interested in joining our community as a volunteer, mentor or a partner?
es: ¿Está interesado en unirse a nuestra comunidad como voluntario, mentor o ¿compañero?
fi: Oletko kiinnostunut liittymään yhteisöömme vapaaehtoisena, mentorina tai a kumppani?
fr: Êtes-vous intéressé à rejoindre notre communauté en tant que bénévole, mentor ou partenaire?

source: Drop us an email at
es: Envíanos un correo electrónico a
fi: Lähetä meille sähköpostia osoitteeseen
fr: Envoyez-nous un e-mail à

source: we will send you more information and guide you through your journey with
es: le enviaremos más información y lo guiaremos a través de su viaje con
fi: lähetämme sinulle lisätietoja ja opastamme sinua matkallasi
fr: nous vous enverrons plus d'informations et vous guiderons tout au long de votre voyage avec

source: ELAN Dome Consultants.
es: Consultores ELAN Dome.
fr: ELAN Dôme Consultants.

source: Sign up today
es: Regístrate hoy
fi: Rekisteröidy tänään
fr: Inscrivez-vous aujourd'hui

source: All Rights Reserved
es: Reservados todos los derechos
fi: Kaikki oikeudet pidätetään
fr: Tous les droits sont réservés

source: ABOUT US
es: Sobre nosotros
fi: MEISTÄ
fr: À PROPOS DE NOUS

source: How we run
es: Como corremos
fi: Kuinka juoksemme
fr: Comment nous courons

source: Structure and People
es: Estructura y Personas
fi: Rakenne ja ihmiset
fr: Structure et personnes

source: RESOURCES
es: RECURSOS
fi: RESURSSIT
fr: RESSOURCES

source: Media Center
es: Centro de Medios
fi: Mediakeskus
fr: Centre des médias

source: Our Community
es: Nuestra Comunidad
fi: Meidän yhteisömme
fr: Notre communauté

source: GET INVOLVED
es: INVOLUCRARSE
fi: OSALLISTU
fr: ÊTRE IMPLIQUÉ

source: Our Programs
es: Nuestras Programas
fi: Ohjelmamme
fr: Nos programmes

source: Volunteer with Us
es: Únete a Nosotros
fi: Tule vapaaehtoiseksi kanssamme
fr: Faites du bénévolat avec nous

source: LATEST
es: MÁS RECIENTE
fi: VIIMEISIN
fr: DERNIER

source: WORK WITH US
es: TRABAJA CON NOSOTROS
fi: TYÖSKENTELE KANSSAMME
fr: TRAVAILLE AVEC NOUS

source: We integrate international experience, community service and supervision and implementation support to ensure that our clients get the best outcomes from our various programs
es: Integramos experiencia internacional, servicio comunitario y supervisión y soporte de implementación para asegurar que nuestros clientes obtengan los mejores resultados de nuestros varios programas
fi: Yhdistämme kansainvälisen kokemuksen, yhteisöpalvelun ja valvonnan sekä käyttöönottotukea varmistaaksemme, että asiakkaamme saavat parhaat tulokset erilaisista ohjelmistamme
fr: Nous intégrons l'expérience internationale, le service communautaire et la supervision et soutien à la mise en œuvre pour s'assurer que nos clients obtiennent les meilleurs résultats de nos différents programmes

source: Our Gallery
es: Nuestro Galeria
fi: Meidän galleria
fr: Notre galerie

source: Our History
es: Nuestra Historia
fi: Historiamme
fr: Notre histoire

source: Okore Booker Charles as a student at the Starehe Boys Center where values of impact creation and community service were inculcated
es: Okore Booker Charles como estudiante en el Starehe Boys Center donde los valores de se inculcó la creación de impacto y el servicio comunitario
fi: Okore Booker Charles opiskelijana Starehe Boys Centerissä, jossa arvot vaikutuksen luominen ja yhteisöpalvelu otettiin käyttöön
fr: Okore Booker Charles en tant qu'étudiant au Starehe Boys Center où les valeurs de la création d'impact et le service communautaire ont été inculqués

source: ELAN (Education, Learning and Networking) Dome Consultants was incorporated under the efforts of three young, ambitious and human centred design driven ladies who were seeking to make empathy the key informant of design, decisions and solutions for people and businesses aimed at the progress of Africa.
es: ELAN (Educación, Aprendizaje y Redes) Dome Consultants se incorporó gracias a los esfuerzos de tres damas jóvenes, ambiciosas y centradas en el diseño humano que buscaban hacer de la empatía el informante clave de diseño, decisiones y soluciones para personas y empresas destinada al progreso de África.
fi: ELAN (Education, Learning and Networking) Dome Consultants perustettiin kolmen ponnisteluilla nuoria, kunnianhimoisia ja ihmiskeskeisiä designvetoisia naisia, jotka halusivat tehdä empatiasta keskeisen informantin suunnittelusta, päätöksistä ja ratkaisuista ihmisille ja yrityksille suunnattu Afrikan kehitykseen.
fr: Consultants Dôme ELAN (Éducation, Apprentissage et Réseautage) a été incorporé sous les efforts de trois young, ambitious and human centred design driven ladies who cherchaient à faire de l'empathie l'informateur clé de conception, de décisions et de solutions pour les particuliers et les entreprises visant au progrès de l'Afrique.

source: The founding partner of ELAN Dome draws deep inspiration from the intelligence, problem solving capability, mobilizing acumen and deep community service acts of her late father, Engineer Okore Booker Charles, OBC. He dedicated his life to fixing challenges, using his personal resources to support family, neighbours, friends, the community and strangers whenever he got the opportunity. He valued education, politics, farming, environmental preservation and human rights.
es: El socio fundador de ELAN Dome se inspira profundamente desde la inteligencia, la capacidad de resolución de problemas, movilizando la perspicacia y los profundos actos de servicio comunitario de su difunto padre, ingeniero Okore Booker Charles, OBC. Él dedicó su vida a arreglar desafíos, usando su personal recursos para apoyar a la familia, vecinos, amigos, la comunidad y extraños cada vez que tenía la oportunidad. Valoraba la educación, la política, la agricultura, el medio ambiente conservación y derechos humanos.
fi: ELAN Domen perustajaosakas saa syvää inspiraatiota älykkyydestä, ongelmanratkaisukyvystä, mobilisoivaa älykkyyttä ja syvää yhdyskuntapalvelua edesmennyt isä, insinööri Okore Booker Charles, OBC. Hän omisti elämänsä haasteiden ratkaisemiseen käyttämällä henkilökohtaista resursseja tukea perhettä, naapureita, ystäviä, yhteisöä ja vieraita aina kun hän sai tilaisuuden. Hän arvosti koulutusta, politiikkaa, maataloutta ja ympäristöä suojelu ja ihmisoikeudet.
fr: Le partenaire fondateur d'ELAN Dome s'inspire profondément de l'intelligence, de la capacité de résolution de problèmes, mobilisant sa perspicacité et ses actes de service communautaire profonds feu père, ingénieur Okore Booker Charles, OBC. Il a consacré sa vie à relever des défis, en utilisant son ressources pour soutenir la famille, les voisins, les amis, la communauté et les étrangers chaque fois qu'il en avait l'occasion. Il valorisait l'éducation, la politique, l'agriculture, l'environnement preservation and human rights.

source: His main target groups were the elderly, the poor, orphans, girls of school going age and the oppressed in the society. He was an ardent believer in the law as an instrument of seeking justice and achieving balance in the society. He constantly stepped in to oversee his friends' projects and manage teams on their behalf whenever they were away on international engagements, having resigned on a voluntary basis to dedicate his life to service.
es: Sus principales grupos objetivo eran los ancianos, los pobres, los huérfanos, huérfanos, las niñas de la escuela ir edad y los oprimidos en la sociedad. Era un ferviente creyente en la ley como instrumento de buscar la justicia y lograr el equilibrio en la sociedad. Intervino constantemente para supervisar los proyectos de sus amigos y administre equipos en su nombre cuando estén fuera en compromisos internacionales, habiendo renunciado voluntariamente base para dedicar su vida al servicio.
fi: Hänen pääkohderyhmänsä olivat vanhukset, köyhät, orvot, kouluikäiset tytöt ja yhteiskunnan sorretut. Hän uskoi kiihkeästi lakiin sen välineenä oikeudenmukaisuuden ja tasapainon saavuttaminen yhteiskunnassa. Hän astui jatkuvasti sisään valvomaan ystäviensä projekteja ja hallita ryhmiä heidän puolestaan aina, kun he olivat poissa kansainvälisistä sitoumuksista erottuaan vapaaehtoisesti perusta omistaa elämänsä palvelulle.
fr: Ses principaux groupes cibles étaient les personnes âgées, les pauvres, les orphelins, les filles en âge d'aller à l'école et les opprimés dans la société. Il était un ardent partisan de la loi en tant qu'instrument de rechercher la justice et parvenir à un équilibre dans la société. Il intervenait constamment pour superviser les projets de ses amis et gérer les équipes en leur nom chaque fois qu'ils sont absents sur des engagements internationaux, ayant démissionné volontairement base pour consacrer sa vie au service.

source: This organization is deeply rooted in his values of sincerity, service, smart work, advocacy, diligence, strategy, impact achievement and celebration. The dome signifies a sense of coming together in a community set up like traditional African families did. They would gather in groups to talk about their issues, find solutions, share meals, support each other and build relationships.
es: Esta organización está profundamente arraigada en sus valores de sinceridad, servicio, trabajo inteligente, defensa, diligencia, estrategia, logro de impacto y celebración. La cúpula significa un sentido de reunirse en una comunidad establecida como lo hicieron las familias africanas tradicionales. ellos se juntarían grupos para hablar sobre sus problemas, encontrar soluciones, compartir comidas, apoyarse unos a otros y construir relaciones.
fi: Tämä organisaatio on syvästi juurtunut hänen arvoihinsa vilpittömyys, palvelu, älykäs työ, edunvalvonta, ahkeruus, strategia, vaikutus saavutukseen ja juhlaan. Kupoli merkitsee a tunne siitä, että tulet yhteen sellaiseen yhteisöön perinteiset afrikkalaiset perheet tekivät. He kokoontuisivat sisään ryhmiä keskustelemaan ongelmistaan, löytämään ratkaisuja, jakamaan aterioita, tukea toisiaan ja rakentaa ihmissuhteita.
fr: Cette organisation est profondément ancrée dans ses valeurs de sincérité, service, travail intelligent, plaidoyer, diligence, stratégie, avoir un impact sur la réalisation et la célébration. Le dôme signifie un sentiment de se retrouver dans une communauté constituée comme les familles africaines traditionnelles l'ont fait. Ils se rassembleraient dans groupes pour parler de leurs problèmes, trouver des solutions, partager des repas, s'entraider et nouer des relations.

source: Engineer OBC had extensive networks and was able to strike new but formidable friendships by the first meeting, an attribute that resulted in his family receiving valuable support throughout his sickness, final demise and graceful send off. From this, the organization draws the value of networking, collaboration and cooperation in building functional ecosystems for individuals, groups and organizations.
es: El ingeniero OBC tenía redes extensas y pudo atacar amistades nuevas pero formidables por el primer encuentro, un atributo que resultó en que su familia recibiera un valioso apoyo a lo largo de su enfermedad, fallecimiento final y elegante despedida. De esto, la organización saca el valor de la creación de redes, colaboración y cooperación en la construcción de ecosistemas funcionales individuos, grupos y organizaciones.
fi: Insinööri OBC:llä oli laajat verkostot ja hän pystyi iskemään uusia mutta mahtavia ystävyyssuhteita ensimmäisellä tapaamisella, ominaisuus jonka seurauksena hänen perheensä sai arvokasta tukea koko sairautensa, lopullisen kuolemansa ja suloisen lähetyksensä ajan. Tästä, organisaatio ammentaa verkostoitumisen arvoa, yhteistyö ja yhteistyö toimivien ekosysteemien rakentamisessa yksilöt, ryhmät ja järjestöt.
fr: L'ingénieur OBC disposait de vastes réseaux et a pu frapper des amitiés nouvelles mais formidables dès la première rencontre, un attribut qui a permis à sa famille de recevoir un soutien précieux tout au long de sa maladie, de sa disparition définitive et de son envoi gracieux. De cela, l'organisation tire la valeur du réseautage, collaboration et coopération dans la construction d'écosystèmes fonctionnels pour personnes, groupes et organisations.

source: Let's Talk
es: Hablemos
fi: Puhutaan
fr: Parlons

source: Experiential Learning
es: Aprendizaje experimental
fi: Kokeellinen oppiminen
fr: Apprentissage expérimentale

source: Beyond Borders.
es: Más allá de las fronteras.
fi: Yli rajojen.
fr: Au delà des frontières.

source: Experience adventure and learning concurrently through our personalized packages.
es: Experimente la aventura y el aprendizaje al mismo tiempo a través de nuestro personalizado paquetes.
fi: Koe seikkailu ja oppiminen samanaikaisesti henkilökohtaisen räätälöinnin kautta paketteja.
fr: Vivez l'aventure et l'apprentissage simultanément grâce à notre programme personnalisé paquets.

source: Get in touch - it's free
es: Póngase en contacto - es gratis
fi: Ota yhteyttä - se on ilmainen
fr: Contactez-nous - c'est gratuit

source: We're with you.
es: Nosotros estamos contigo
fi: Olemme kanssasi.
fr: Nous sommes avec vous.

source: We are a goal oriented outsourcing consultancy firm that strives to optimize collaborative partnerships and provide carefully curated programs while stating result oriented.
es: Somos una firma de consultoría de externalización orientada a objetivos que se esfuerza por optimizarasociaciones de colaboración y proporcionar programas cuidadosamente seleccionados mientras declarando orientado a resultados.
fi: Olemme tavoitteellinen ulkoistuskonsulttiyritys, joka pyrkii optimoimaan yhteistyökumppanuuksia ja tarjota huolellisesti kuratoituja ohjelmia samalla ilmaistaan tulossuuntautuneena.
fr: Nous sommes une société de conseil en externalisation axée sur les objectifs qui s'efforce d'optimiser partenariats collaboratifs et fournir des programmes soigneusement sélectionnés tout en déclarant orienté résultat.

source: Our team is driven to do what's right and help you realize your vision. We believe in generating success collaboratively, delivering great results after every engagement, and building trust for the next big challenge.
es: Nuestro equipo está motivado para hacer lo correcto y ayudarlo a realizar su visión. Nosotros cree en generar éxito en colaboración, entregando grandes resultados después de cada compromiso y generar confianza para el próximo gran desafío.
fi: Tiimimme haluaa tehdä oikein ja auttaa sinua toteuttamaan visiosi. Me usko menestyksen tuottamiseen yhteistyössä ja loistavien tulosten tuottamiseen jokaisen osallistumisen jälkeen ja rakentaa luottamusta seuraavaa suurta haastetta varten.
fr: Notre équipe est déterminée à faire ce qui est juste et à vous aider à réaliser votre vision. Nous croient en la réussite collaborative, en obtenant d'excellents résultats après chaque engagement, et établir la confiance pour le prochain grand défi.

source: Focus Areas
es: Áreas de Enfoque
fi: Painopistealueet
fr: Domaines d'intervention

source: Volunteer Services
es: Únete a Nosotros
fi: Vapaaehtoispalvelut
fr: Services bénévoles

source: The OBC volunteer program was created in honor of the Late Engineer Okore Booker Charles. This program has been carefully curated to reflect and inculcate the values that he lived by throughout his life in community service and social impact.
es: El programa de voluntariado de la OBC fue creado en honor a la El difunto ingeniero Okore Booker Charles. Este programa ha sido cuidadosamente curado a reflexionar e inculcar los valores por los que vivió a lo largo de su vida en el servicio comunitario y el impacto social.
fi: OBC-vapaaehtoisohjelma luotiin kunniaksi Edesmennyt insinööri Okore Booker Charles. Tämä ohjelma on huolellisesti kuratoitu to pohtimaan ja juurruttamaan arvoja, joiden mukaan hän eli koko elämänsä yhdyskuntapalvelussa ja yhteiskunnallisessa vaikuttamisessa.
fr: Le programme de bénévolat de l'OBC a été créé en l'honneur du Feu l'ingénieur Okore Booker Charles. Ce programme a été soigneusement préparé à refléter et inculquer les valeurs qu'il a vécues tout au long de sa vie dans le service communautaire et l'impact social.

source: The OBC volunteer program will help you render assistance to underprivileged and underserved communities where you will experience traditional cultures and even get a chance to interact with rich wildlife all while supporting a good cause and creating a positive impact in the society.
es: El programa de voluntariado de la OBC te ayudará a rendir asistencia a comunidades desfavorecidas y desatendidas donde usted experiencia culturas tradicionales e incluso tener la oportunidad de interactuar con rica vida silvestre mientras apoya una buena causa y crea un ambiente positivo impacto en la sociedad.
fi: OBC-vapaaehtoisohjelma auttaa sinua tekemään apua heikommassa asemassa oleville ja vähäosaisille yhteisöille missä haluat kokea perinteisiä kulttuureja ja jopa mahdollisuuden olla vuorovaikutuksessa rikkaiden villieläinten kanssa samalla kun tuetaan hyvää asiaa ja luodaan myönteistä vaikutusta yhteiskuntaan.
fr: Le programme de bénévolat OBC vous aidera à rendre assistance aux communautés défavorisées et mal desservies où vous vivre cultures traditionnelles et même avoir la chance d'interagir avec une faune riche tout en soutenant une bonne cause et en créant un climat positif impact dans la société.

source: Learn More
es: Aprende más
fi: Lisätietoja
fr: Apprendre encore plus

source: Investment supervision, coordination and implementation
es: Supervisión, coordinación e implementación de inversiones
fi: Investointien valvonta, koordinointi ja toteutus
fr: Supervision, coordination et mise en œuvre des investissements

source: We provide guidance and advice to individuals, groups and institutions about their investments and how to safeguard their interests and attain positive results. We further monitor the activities of these investments to ensure that there's full accountability and clarity on the utilisation of resources.
es: Brindamos orientación y asesoramiento a particulares, grupos e instituciones sobre sus inversiones y cómo salvaguardar sus intereses y obtener resultados positivos. Supervisamos aún más las actividades de estas inversiones. para garantizar que haya total rendición de cuentas y claridad sobre la utilización de los recursos.
fi: Neuvomme ja neuvomme yksilöitä, ryhmiä ja instituutiot kertovat sijoituksistaan ja miten ne tehdään etujaan ja saavuttaa myönteisiä tuloksia. Seuraamme edelleen näiden investointien toimintaa varmistaakseen täyden vastuullisuuden ja selkeyden resurssien käytöstä.
fr: Nous accompagnons et conseillons les particuliers, les groupes et les institutions sur leurs investissements et sur la manière de sauvegarder leurs intérêts et obtenir des résultats positifs. Nous surveillons en outre les activités de ces investissements pour s'assurer qu'il y a pleine responsabilisation et clarté sur l'utilisation des ressources.
